{ layout: 'post',
  title: 'Siglas e Acrónimos',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>Descobri um link bastante útil: o site <a href="http://www.acronymfinder.com/">Acronym Finder</a>, que permite descodificar rapidamente as muitas <a href="http://www1.y12.doe.gov/scripts/y12/acrointro.cfm">siglas e acrónimos</a> que se parecem replicar-se a uma velocidade cada vez maior. Outro site do mesmo género mas especializado em Informática é o <a href="http://www.acronyms.ch/servlet/welcome">TUCAA</a>.</p>\n\n<p>O mundo da informática está em constante mutação, e cria informação nova (e algum conhecimento novo) a uma tal velocidade que é frequente não haver tempo para encontrar uma nova palavra para designar o último grito da tecnologia. Quando há <a href="http://www.salon.com/media/col/shal/1999/11/30/naming/print.html">departamentos de marketing</a> poderosos a intervir para defender a propriedade intelectual de uma empresa, as novas tecnologias são muitas vezes baptizadas formalmente, i.e. é-lhes atribuído um nome. Alguns exemplos recentes são a linguagem de programação <a href="http://en.wikipedia.org/wiki/Java_platform">Java</a>, da Sun Microsystems, e a plataforma <a href="http://en.wikipedia.org/wiki/.NET">.Net</a>, da Microsoft. O nome de baptismo pode ser entre outras coisas uma homenagem (<a href="http://en.wikipedia.org/wiki/Blaise_Pascal">Blaise Pascal</a> -> <a href="http://en.wikipedia.org/wiki/Pascal_programming_language">Pascal</a>), uma referência cultural (<a href="http://en2.wikipedia.org/wiki/Monty_Python">Monty</a> <a href="http://www.bbc.co.uk/dna/h2g2/A687945">Python</a> -> <a href="http://en.wikipedia.org/wiki/Python_programming_language">Python</a>), um efeito gráfico (Inove + 9 -> <a href="http://www.tmn.pt/i9/">i9</a>), uma palavra <a href="http://en.wikipedia.org/wiki/Portmanteau">portmanteau</a> (<a href="http://en2.wikipedia.org/wiki/Linus_Torvalds">Linus</a> + <a href="http://en2.wikipedia.org/wiki/UNIX">Unix</a> -> <a href="http://en2.wikipedia.org/wiki/Linux">Linux</a>, Java + Python -> <a href="http://www.jython.org/">Jython</a>), uma variação sobre um tema (Java -> <a href="http://jakarta.apache.org/">Jakarta</a>), ou um outro mecanismo <a href="http://www.bartleby.com/59/6/whatsinaname.html">arbitrário</a> de emparelhamento de sequências de fonemas com unidades semânticas.</p>\n\n<p>No entanto, quando a criatividade lexical não abunda, a solução mais fácil é pegar num nome composto e criar um novo nome a partir das letras (<a href="http://www.rtp.pt/">RTP - Rádio Televisão Portuguesa</a>) ou sílabas (<a href="http://www.bartleby.com/61/75/G0107500.html">Gestapo</a>) iniciais de todas ou parte das palavras constituintes do nome composto. O nome resultante diz-se uma <a href="http://www.priberam.pt/scripts/dlpouniv.dll?search_value=sigla">sigla</a> quando as suas letras são soletradas e um <a href="http://www.priberam.pt/scripts/dlpouniv.dll?search_value=acr%f3nimo">acrónimo</a> quando é pronunciado como uma palavra normal. Em inglês utilizam-se os termos <a href="http://en2.wikipedia.org/wiki/Initialism">initialism</a> e <a href"http://en2.wikipedia.org/wiki/Acronym">acronym</a> com o mesmo significado, embora seja frequente o termo "acronym" abarcar os dois significados, existindo ainda o termo <a href="http://green.seagull.net/dryad/english/acronyms.html">alphabetism</a>, embora não tenha conseguido perceber o que o diferencia dos outros dois. Este processo constitui um dos mecanismos mais produtivos de criação de novos nomes, em particular em domínios onde a oralidade não constitui o principal meio de transmissão de informação, como a informática.</p>\n\n<p>O problema é que a utilização de siglas e acrónimos pode facilitar a tarefa do baptizador, mas não facilita certamente a tarefa do utilizador. Enquanto que é provável que os verdadeiros acrónimos adquiram o estatuto de nome próprio de pleno direito, acabando a sua origem como nome composto por desaparecer, é duvidoso que o mesmo se passe com as siglas. O seu processamento no cérebro humano difere provavelmente do dos nomes comuns simples, o que poderia explicar parte da dificuldade de aprendizagem de grandes conjuntos de siglas.</p>\n\n' }
