{ layout: 'post',
  title: 'ClearType',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>Com 17 polegadas de diagonal e uma resolução de 1440 por 900 pixeis, pode dizer-se que o meu novo portátil tem um écran bastante generoso. Acontece que com esta resolução, os ícones visíveis no Ambiente de Trabalho se tornam minúsculos, e o tamanho standard das legendas dos ditos ícones se torna pouco legível. Para adequar melhor o aspecto do sistema operativo às dimensões do écran, abri a janela "Display Properties", e no separador "Appearance" cliquei no botão "Effects". Na caixa de diálogo que então aparece, activei a opção "Use large icons", que aumenta o tamanho dos ícones do Ambiente de Trabalho. Infelizmente foi ainda necessário alterar o tamanho do texto do sistema operativo em "Display Properties > Appearance > Font Size" para "Large", algo que deveria ocorrer automaticamente quando se escolhe a opção de ícones grandes. Foi ainda necessário alterar manualmente o tamanho dos ícones, que mudei em "Display Properties > Appearance > Advanced > Icon Spacing (Horizontal)" para 64 pixeis, tal como fiz para "Icon Spacing (Vertical).</p>\n\n<p>Por acaso vi pela primeira vez um pequeno menu, por baixo da opção "Use the following method to smooth edges of screen fonts", que mostra a opção "Standard", e decidi ver que outras opções eram disponibilizadas por esse menu. A alternativa chama-se ClearType, e experimentei activá-la. A melhoria da legibilidade do texto é tão notável, que não percebo por que razão a Microsoft não activa esta opção por defeito em todas as instalações de Windows XP. A qualidade do texto de todas as aplicações aumentou imediatamente de forma extraordinária. Já tinha ouvido falar da <a href="http://www.microsoft.com/typography/cleartype/default.htm">tecnologia ClearType</a>, mas nunca cheguei a experimentá-la, até este dia. Quem quiser activar esta opção pode fazê-lo de forma fácil utilizando esta página da Microsoft: <a href="http://www.microsoft.com/typography/cleartype/cleartypeactivate.htm">Turn on Windows XP ClearType</a></p>\n\n<p>Feitas estas alterações, o Windows XP tornou-se muito mais agradável ao olhar. No entanto, como em tudo, os gostos variam, e já conheci muitos adeptos das estética XP. <em>A chacun son gout...</em></p>\n\n' }
