{ layout: 'post',
  title: 'Charadas',
  published: true,
  category: [ 'Books' ],
  __content: '\n<p>Li recentemente um livro muito engraçado: <a href="http://www.amazon.com/exec/obidos/tg/detail/-/0316919160?v=glance">How Would You Move Mount Fuji</a>. Este livro discute o processo de recrutamento da Microsoft, que aparentemente tem como elemento central a resolução de charadas. Este assunto serve de pretexto para apresentar uma série de charadas que supostamente foram já utilizadas como parte do processo de recrutamento da Microsoft e de outras empresas. Para quem gosta deste tipo de brincadeiras, o livro apresenta charadas com diversos níveis de dificuldade, e apresenta soluções possíveis para cada uma delas no final do livro. Algumas das charadas são já velhas conhecidas para amantes do género, como por exemplo esta:<br />\n<blockquote>Oito bolas de aspecto idêntico têm todas o mesmo peso, com a excepção de uma, cujo peso é superior ao peso normal. Supondo que o único instrumento disponível é uma balança de dois pratos não graduada, qual é o número mínimo de operações necessário para identificar a bola mais pesada em todas as circunstâncias?</blockquote>Outras charadas são variações sobre temas já desbravados, como por exemplo a charada da ilha dos maridos adúlteros. Infelizmente a formulação utilizada no livro complica desnecessariamente o problema, quando o mesmo pode ser formulado de forma perfeitamente equivalente da seguinte maneira:<blockquote>Numa ilha existem 50 habitantes analfabetos que fizeram um voto de silêncio absoluto. Todos eles têm uma pinta preta na testa, mas como não há espelhos na ilha, nenhum deles sabe com certeza absoluta se tem uma pinta na testa. Um dos costumes desta ilha, que é sempre respeitado, é que qualquer pessoa que tenha a certeza absoluta de que tem uma pinta preta na testa deve matar-se na noite seguinte. Um dia, uma vidente que nunca se engana e que nunca mente visita a ilha, e anuncia: "Nesta ilha existe pelo menos um habitante com uma pinta na testa". Qual é a sequência de acontecimentos despoletada por esta afirmação?</blockquote>A charada que mais gozo me deu resolver foi a dos piratas, que não conhecia:<blockquote>Um grupo de cinco piratas com idades diferentes tem de dividir um tesouro de 50 moedas. O pirata mais velho tem o direito de propor um esquema de divisão do tesouro, que é votado por todos. Se pelo menos metade dos votos forem favoráveis, o plano é aprovado. Caso contrário, o pirata mais velho é o morto, e o direito de propor uma divisão do espólio passa para o segundo pirata mais velho. Supondo que todos os piratas prezam a vida, são extremamente gananciosos e impiedosamente lógicos, qual é o plano de partilha do tesouro que deve ser proposto pelo pirata mais velho?</blockquote>No entanto, a charada mais admirável de todas, que confesso que não consegui resolver, foi a seguinte:<blockquote>Numa mesa rectangular, dois jogadores colocam alternadamente moedas sobre a superfície da mesa, ganhando aquele que conseguir por a última moeda. As moedas são todas idênticas e nunca se sobrepõem, e uma vez postas na mesa não se podem mover. Supondo que somos o primeiro jogador a pôr uma moeda na mesa, qual é a estratégia que permite infalivelmente ganhar o jogo?</blockquote>A solução apresentada no livro para esta charada é extremamente elegante.</p>\n\n' }
