{ layout: 'post',
  title: 'Repudiadores Santânicos',
  published: true,
  categories: [ 'Current Affairs', 'Portugal' ],
  __content: '\n<p><a href="http://olifante.blogs.com/covil/images/IMGP5279.png"><img src="http://olifante.blogs.com/covil/images/IMGP5279-tm.jpg" height="200" width="150" alt="IMGP5279" /></a>\n</p>\n<p>A manifestação de Domingo em frente ao Palácio de Belém foi bastante participada. Alguns milhares de pessoas protestaram veementemente durante mais de duas horas em frente da residência do Presidente da República contra a transferência administrativa do poder executivo sem uma consulta popular. Embora tenha visto vários bloquistas, membros da ATTAC e membros e ex-membros da JCP, o público pareceu-me bastante variado. Não vi um único símbolo partidário nem ouvi nenhum slogan conotado com um partido específico. Vi apenas um repúdio generalizado perante esta fuga irresponsável que entrega o país às feras. \n</p><p>\nEstavam presentes várias personalidades conhecidas, como Helena Roseta, Fernando Rosas, Miguel Portas, Diana Andringa, Isabel do Carmo, e - pasme-se - o José Manuel Fernandes, director do Público e apoiante de primeira água do governo de Durão Barroso e da guerra do Iraque. A presença de José Manuel Fernandes na manifestação é para mim sintomática dos poucos apoios que Santana Lopes recolhe mesmo naquela que deveria ser a sua base de apoio natural. José António Lima e Henrique Monteiro, respectivamente Director-adjunto e Subdirector do semanário <a href="http://online.expresso.clix.pt/1pagina/default.asp">Expresso</a>, manifestaram na edição de 2004-06-26 grandes reservas relativamente ao nome de Santana Lopes. Cronistas como Vasco Pulido Valente, Pacheco Pereira e Alfredo Barroso criticaram duramente a partida de Durão Barroso para Bruxelas, e Freitas do Amaral e Francisco van Zeller também atacaram a decisão. No PSD, Manuela Ferreira Leite e Marques Mendes já aproveitaram para se demarcar de Santana Lopes.\n</p><p>\nRestam figuras como José António Saraiva e Luís Delgado para apoiar esta transição mirabolante. Quanto ao primeiro, o que é que se há de esperar do homem que escreve em média uma frase e meia ideia por parágrafo? Quanto a <a href="http://causa-nossa.blogspot.com/2004/06/ministro-da-propaganda.html">Luís Delgado</a>, já há muito que este escolheu afundar-se no atoleiro da bajulação acrítica e acéfala do poder instituído.\n</p>\n\n' }
