{ layout: 'post',
  title: 'Onde é que fica a saída?',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>Colin Powell <a href="http://www.suntimes.com/output/iraq/cst-nws-iraq16.html">anunciou</a> que os EUA retirariam do Iraque, caso o governo provisório iraquiano o solicitasse, enquanto Paul Bremer declarou que os EUA não ficariam num país onde não são desejados. Embora tenham sublinhado que consideravam tal hipótese extremamente improvável, quem tem dois dedos de testa percebe que estas declarações assinalam o início do reconhecimento oficial do falhanço da aventura iraquiana. O objectivo é agora sair do atoleiro o mais depressa possível e salvar o que resta do prestígio americano.</p>\n<a href="http://www.theglobeandmail.com/servlet/ArticleNews/TPStory/LAC/20040515/DOUG15/TPComment/TopStories">The timely exit</a>\n<blockquote>"The Bush administration seems not to recognize how widespread, and how bipartisan, is the view that Iraq is already lost or on the verge of being lost." Those words were written this week not by a leftist or a Democrat, but by William Kristol and Robert Kagan, two of the more stalwart neoconservatives in Washington and two of the voices that were most assertively optimistic last year about the potential outcome of the Iraq war.</blockquote>\n\n<a href="http://www.counterpunch.org/lind05122004.html">Bush\'s Waterloo? Plan to Get Out Now or Face a Disastrous Defeat</a>\n<blockquote>[...] the growing probability is that we will be driven out of Iraq by a general uprising, an intifada in which every American will be the target of every Iraqi and our boys (and, in America\'s Neo-Model Army, girls) will have to fight their way out [...]</blockquote>\n<a href="http://www.theglobeandmail.com/servlet/ArticleNews/TPStory/LAC/20040515/DOUG15/TPComment/TopStories">How the US Can Get Out</a>\n<blockquote>The situation on the ground in Iraq is getting worse. This may or may not be linked to Washington\'s faulty rationale for occupying Iraq in the first place, but it is certainly a consequence of poor U.S. comprehension of the dynamic of the country.</blockquote>\nFechem a porta depois de sair.\n\n' }
