{ layout: 'post',
  title: 'Após o Império',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>A Pax Americana está a chegar ao fim, como tão claramente previu o historiador e demógrafo <a href="http://www.herodote.net/livreTodd.htm">Emmanuel Todd</a> no seu livro <a href="http://www.edicoes70.pt/edicoes70/livro.asp?id=1212">Após o Império</a>. O MetaFilter tem um <a href="http://www.metafilter.com/mefi/33382">artigo</a> recheado de apontadores para uma série de análises devastadoras dos erros estratégicos da política externa norte-americana, e das consequências monumentais que esta derrota terá para o poder americano no mundo.</p>\n\n<p>\nO memorando\n<a href="http://www.d-n-i.net/fcs/comments/c510.htm">Iraq Net Assessment : Strategic Overview and Recommendations</a>, publicado no <a href="http://www.d-n-i.net/">Defense and the National Interest</a> e obviamente escrito por um analista profissional, faz o balanço da guerra do Iraque em termos de ganhos e perdas, rematando com algumas recomendações para o curto e médio prazo. Embora algo extenso, o artigo é demasiado bom para ser representado por uma mera citação. Leitura integral vivamente recomendada.</p>\n\n<p>O excelente artigo <a title="Whiskey Bar: Failure Mode" href="http://billmon.org/archives/001487.html#more">Failure Mode</a> contempla as consequências do falhanço da Operação Liberdade para o Iraque:</p>\n<blockquote><cite><p>\nSo this is what failure looks like – and, realistically, it’s much too late to look to the UN or NATO or our Arab “allies” to save us from the consequences of the administration’s folly.\n</p><p>\nStrategic failure on such a grand scale is obviously going to have huge repercussions, not just in Iraq, not just in the Middle East, and not just for the war against Al Qaeda. Much more than 9/11, a U.S. defeat in Iraq (or, at least, an outcome that is perceived as a strategic defeat both at home and abroad) has at least the potential to change, if not everything, then lots of things -- from the U.S. political balance of power, to the future of NATO, to the health of the global economy.\n</p></cite></blockquote>\n</a>\n<p>Vale ainda a pena ler o artigo <a href="http://216.239.53.104/search?q=cache:0z8gUGUBQWoJ:www.csis.org/features/iraq_whatdone.pdf+%22What+is+to+Be+Done+Anthony+H.+Cordesman%22&hl=en">The Eroding US Position on Iraq</a>, escrito por Anthony Cordesman para o <a href="http://www.csis.org">Center for Strategic and International Studies</a> (artigo original em <a href="http://www.csis.org/features/iraq_whatdone.pdf">formato pdf</a>).</p>\n\n' }
