{ layout: 'post',
  title: 'Found in Translation',
  published: true,
  categories: [ 'Books', 'Current Affairs' ],
  __content: '\n<p><a title="translation company UK, UK translation agency, translation company london, translation services, translation agency, translation jobs, translators, trade transcription" href="http://www.todaytranslations.com/index.php/fuseaction/home.content/page/press">The most untranslatable word in the world</a>\n</p>\n<p>\nA "Saudade" portuguesa aparece em sétimo lugar numa lista das dez palavras mais difíceis de traduzir para inglês. A lista é o resultado de um inquérito patrocinado pela agência de traduções Today Translations, e envolveu cerca de um milhar de linguistas. Aqui vai a lista completa:</p>\n<ol><li>\nilunga [pessoa que perdoa tudo à primeira e à segunda ofensa, mas não à terceira (tshiluba, língua da família Bantu)]\n</li><li>\nshlimazl [azarado crónico (yiddish)]\n</li><li>\nradioukacz [telegrafista dos movimentos de resistência no lado soviético da Cortina de Ferro (polaco)]\n</li><li>\nnaa [partícula usada para emfatizar declarações ou exprimir concordância (regionalismo japonês)]\n</li><li>\naltahmam  [um tipo particular de tristeza profunda (árabe)]\n</li><li>\ngezellig [aconchegado, acolhedor (holandês)]\n</li><li>\nsaudade\n</li><li>\nselathirupavar  [certo tipo de gazeta ou falta injustificada (tamil)]\n</li><li>\npochemuchka [perguntador excessivo (russo)]\n</li><li>\nklloshar [falhado, perdedor (albanês)]\n</li></ol>\n<p>\nEstas listas são sempre divertidas, mas há que explicar melhor o que se quer dizer com "impossível de traduzir" quando na mesma linha se oferece uma tradução. A ideia central é que a palavra em si não é impossível de traduzir: Saudade pode ser traduzido para inglês como "longing" ou para alemão como "Sehnsucht", e algumas outras palavras poderão ser traduzidas não por uma única palavra mas sim por uma expressão composta. A questão fundamental é que as palavras em questão ocupam um papel central numa determinada cultura, o que significa que qualquer tradução para outro idioma é incapaz de transportar todo o contexto cultural que ressoa com essa palavra.\n</p><p>\nEste é no final de contas o problema fundamental da tradução, tão brilhantemente discutido no maravilhoso livro <a href="http://www.amazon.com/exec/obidos/tg/detail/-/0465086454/104-7771388-8299137?v=glance&vi=contents">Le Ton Beau De Marot: In Praise of the Music of Language</a>: para traduzir de forma perfeita um texto, temos de traduzir também todo o universo de referências culturais no qual esse texto nasce. Essa tarefa é obviamente impossível, ou dito de outra maneira, a única forma de a concretizar consiste em mergulhar na língua e cultura do texto original. Foi a opção que tomei há já vários anos, quando me fartei das ineficiências das leituras por pessoa interposta e tomei a decisão deliberada de deixar de ler traduções de inglês para português e passar a ler exclusivamente os originais em inglês. A opção alternativa consiste em aceitar que a tradução completa é impossível - "<a href="http://www.espirito.org.br/portal/artigos/diversos/estudo/traduttore.html">Traduttore, Traditore</a>" - e valorizar antes a ideia de transposição hibridizante. Douglas Hofstadter ilustra de forma exemplar no seu livro a ideia de que a tradução pode ser um trabalho profundamente criativo, e que o texto original pode ser enriquecido pelas novas leituras e contextos proporcionados por uma boa tradução.\n</p>\n\n' }
