{ layout: 'post',
  title: 'Segurança Electrónica',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>O Bruce Schneier, perito em segurança, tem um novo artigo com uma série de recomendações para proteger o computador de ataques e infecções.</p>\n\n<p></p>\n\n<p>Link: <a title="Schneier on Security: Safe Personal Computing" href="http://www.schneier.com/blog/archives/2004/12/safe_personal_c.html">Schneier on Security: Safe Personal Computing</a>.</p>\n\n<p></p>\n\n<p>Resumidamente, os conselhos são:</p>\n\n<ul><li>Não usar o Windows, se possível. Usar sistemas operativos mais seguros, como o MacOSX ou Linux;</li>\n\n<li>Não usar o Internet Explorer. Usar um browser mais seguro, como o Firefox;</li>\n\n<li>Não usar o Outlook / Outlook Express. Usar um cliente de email mais seguro, como o Thunderbird;</li>\n\n<li>Não usar o Microsoft Office. Usar uma suite de produtividade mais segura, como o OpenOffice;</li>\n\n<li>Usar um Antivírus e actualizá-lo regularmente. Para Windows, recomendo um AV gratuito como o Avast ou o AVG;</li>\n\n<li>Usar um ou mais programas de detecção de spyware e executá-los e actualizá-los regularmente. Para Windows, recomendo o Ad-Aware e o Spybot Search &amp; Destroy;</li>\n\n<li>Usar uma firewall pessoal em cada PC e mantê-la sempre ligada. Para Windows serve o ZoneAlarm Personal Edition ou a firewall integrada do XP SP2;</li>\n\n<li>Comprar e usar uma firewall com hardware dedicado que tenha NAT e mantê-la sempre ligada. Muitos routers de redes sem fios incorporam uma firewall, como p.ex. o Linksys WRT54G;</li>\n\n<li>Apagar o spam sem o ler;</li>\n\n<li>Não abrir email com anexos a não ser quando estritamente necessário;</li></ul>\n\n<p>Nada de estonteantemente novo, a não ser o seguinte:</p><blockquote><p>Passwords: You can\'t memorize good enough passwords any more, so don\'t\nbother. For high-security Web sites such as banks, create long random\npasswords and write them down. Guard them as you would your cash: i.e.,\nstore them in your wallet, etc.</p></blockquote><p>Por estes dias parece que a segurança através de <em>coisas que sabemos</em> já é demasiado frágil para servir para alguma coisa. Regressamos ao velho método da segurança através de <em>coisas que temos</em>.</p>\n\n' }
