{ layout: 'post',
  title: 'Voto Preto',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\nAs discussões sobre o voto em branco não saem geralmente da cepa torta. Os seus apologistas defendem-no como uma oportunidade de tornar visível a insatisfação com o sistema político vigente. Para estes, o voto em branco é valioso porque permite a diferenciação da rejeição abstencionista, na qual se confundem cépticos, indiferentes, preguiçosos, ignorantes e tolos. Do outro lado da barricada, os seus detractores apresentam-no como inútil ou até infantil: Inútil, porque é um voto desperdiçado que não influencia o resultado das eleições; infantil, porque constitui uma recusa em fazer escolhas difíceis, nem que seja para eleger o menor de dois males.\n<br/><br/>\nEmbora tenha começado por ser apologista fervoroso do voto em branco como escolha política legítima, hoje em dia tendo a ver o voto em branco como uma opção pouco eficaz. Embora a recusa activa das escolhas apresentadas seja mais informativa do que a recusa passiva, continua a ser uma opção muito ambígua, na medida em que não fornece qualquer pista sobre qual o caminho a seguir, excepto para dizer que não é certamente nenhum dos que foram postos à nossa consideração. O problema é que caminhos há muitos, pelo menos tantos quantos os que votam em branco, o que dilui significativamente o impacto mediático do voto em branco. Em sociedades com liberdade de expressão e de associação política, há formas consideravelmente mais eficazes e construtivas de exprimir o desacordo com o sistema vigente. \n<br/><br/>\nNos dias de hoje, em que o advento da internet fez baixar os custos da micro-publicação para perto de zero, como é ilustrado pelo fenómeno dos blogues, defender o voto em branco como forma de acção política parece-me uma estratégia particularmente falha de imaginação.\n<br/><br/>\nExistem no entanto várias situações de excepção nas quais o voto branco pode ser útil. Quem não tem espadas combate com paus, e quando desaparece a liberdade de expressão ou a liberdade de associação política, o voto em branco pode-se tornar uma ferramenta importante, sobretudo nos períodos de transição. No entanto, quando desaparecem ou se reduzem estas liberdades fundamentais, aumenta a probabilidade de as eleições serem falsificadas, reduzindo o valor do voto em branco, ou melhor dizendo do voto tout court. O voto em branco terá talvez a sua utilidade máxima em situações pontuais de distorção das regras do jogo político: Quando o poder vigente inventa em cima da hora critérios arbitrários para impedir determinados candidatos de concorrer às eleições, como aconteceu recentemente no <a href="http://www.iht.com/articles/130793.html">Irão</a>, o voto em branco pode ser uma válvula de escape importante, sobretudo em países em que o voto é obrigatório. Em casos de distorção muito grave, no entanto, a melhor estratégia poderá ser mesmo a do boicote, já que falsificar votos é bastante mais fácil do que simular uma afluência massiça às urnas.\n<br/><br/>\nÉ preciso não esquecer que as escolhas que nos são apresentadas são já de si o resultado de uma escolha, escolha essa que não é directamente controlada pelos eleitores, havendo uma série de intermediários que interpretam a legislação de forma a decidir quem tem o direito se concorrer a eleições. O voto em branco é uma das poucas ferramentas de que os eleitores dispõem para se pronunciar sobre esse processo. O facto de provavelmente só ser verdadeiramente útil em situações de crise não reduz em nada a necessidade da sua existência.\n<br/><br/>\nApesar da sua importância como válvula de segurança, o facto de o voto em branco ser representado no boletim de voto apenas pela ausência de escolha é uma má opção: primeiro, não reconhece o voto em branco como uma opção de pleno direito; segundo, um boletim em branco é muito fácil de alterar - basta um dos muitos interveniente no processo de contagem pôr uma cruz num dos candidatos, e bingo!, eis um boletim de voto perfeitamente válido que não corresponde à intenção de voto inicial. A própria designação de voto em branco favorece a sua interpretação como ausência de escolha. Seria preferível substituí-lo por um <em>voto preto</em> mais resoluto, que seja representado explicitamente em todos os boletins de voto. Enquanto não surge o <em>voto preto</em> explícito, a forma mais segura de o exprimir é a utilização do voto nulo: riscar o boletim de voto duma ponta à outra.\n\n' }
