{ layout: 'post',
  title: 'A Classe Creativa Portuguesa',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>No livro <a href="http://www.creativeclass.org/book.shtml">The Rise of the Creative Class: And How it\'s Transforming Work, Leisure, Community, and Everyday Life</a>, Richard Florida (<a href="http://www.salon.com/books/int/2002/06/06/florida/print.html">entrevista</a>) lançou o conceito de <strong>Classe Creativa</strong>, que corresponde grosso modo aos chamados "knowledge workers", em cujo trabalho predominam o processamento de informação e as tarefas conceptuais. Richard Florida defende que a capacidade das sociedades de atrair e reter este segmento da população joga um papel determinante na sua prosperidade, e especula em <a href="http://www.alternet.org/story.html?StoryID=17576">Creative Class War</a> que os EUA podem estar a perder o seu papel como íman para a classe creativa a nível mundial.</p>\n<p>O conceito de classe criativa tem dado que falar, e  Richard Florida elaborou recentemente para o thinktank britânico <a href="http://www.demos.co.uk/aboutus/default.aspx">Demos</a> um relatório intitulado <a href="http://www.demos.co.uk/media/creativeeurope_page373.aspx">Europe in the Creative Age</a> no qual faz uma análise comparativa da classe creativa dos EUA e de 13 países europeus, e do impacto que esta tem na sua prosperidade. O relatório, que está gratuitamente disponível em <a href="http://www.demos.co.uk/EUCIfinal_pdf_media_public.aspx">formato pdf</a>, teve direito a uma notícia no Suplemento Computadores do Público desta semana, com o sombrio título <a title="Portugal com atraso de 50 anos na criatividade" href="http://jornal.publico.pt/2004/05/10/magoo/Computadores/TI03.html">Portugal com atraso de 50 anos na criatividade</a>. De facto, se aceitarmos a tese de Richard Florida, as notícias não são particularmente animadoras para o nosso país. Em Portugal a classe creativa representa pouco mais de 13% da população, contra quase 30% em países como a Holanda. Os países nórdicos, com destaque para os escandinavos, parecem ser aqueles que na Europa melhor conseguem transformar a creatividade num motor do desenvolvimento.\n</p>\nÉ certo que a maioria dos países que lideram este ranking têm níveis de educação e de riqueza bastante superiores ao nosso, e não é certamente por acaso que praticamente todos (excepto os EUA) seguem modelos social-democratas com estados-providência generosos, com uma rede de segurança que suaviza drasticamente as consequências do fracasso de um projecto pessoal. Isto mostra, se dúvida havia, que Social-Democracia e Iniciativa Privada não são de todo incompatíveis, podendo pelo contrário potenciar-se mutuamente.\n</p>\n\n' }
