{ layout: 'post',
  title: 'Luto Azul',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\nAlguns comentários da blogosfera democrata americana:<br/>\n<a title="The Left Coaster: The Most Difficult Post" href="http://www.theleftcoaster.com/archives/003174.html">The Left Coaster: The Most Difficult Post</a>\n<blockquote><cite>\nSure, the GOP will immediately enter into a civil war, and inevitably George W. Bush will cause irreparable harm to this country in the next two years with a GOP House and Senate that will rubber stamp every mistake he makes. And yes the Democrats will rebound in the 2006 midterms as the GOP suffers from the second-term implosion. But by then, the harm to our social fabric of having the religious right gain total control over our social and foreign policies and judicial appointments, while the economic elites savage our communities, environment, and economy for private gain over public interest will be incalculable and significant. Yet that is what a majority of those who voted tonight wanted. So the voters deserve what they are about to get. No excuses.\n</cite></blockquote>\n<br/>\n<a href="http://www.amber.org/~petrilli/archive/2004/11/03/four_more_tears.html">\nPensieri di un lunatico minore: Four more tears</a>\n<blockquote><cite>\nIn the end, there’s blame to go around, but the reality is that we are at a turning point in American liberal politics. The Democrats are over, done and finished. They are irrelevant. It is time for us to build a new party, or eviscerate this one. Too much compromise, too much Republican-lite, too much pandering to both sides of every issue, and too much time spend navel gazing, rather than fighting the war that we have been dragged into.</cite></blockquote>\n<br/>\n<a href="http://weblog.siliconvalley.com/column/dangillmor/archives/010986.shtml#010986">\nSilicon Valley - Dan Gillmor\'s eJournal - Four More Years</a>\n<blockquote><cite>\nPeople say there are two Americas. I think there are at least three.\n<br/><br/>\nOne is Bush\'s America: an amalgam of the extreme Christian "conservatives," corporate interests and the builders of the burgeoning national-security state.\n<br/><br/>\nAnother is the Democratic "left": wedded to the old, discredited politics in a time that demands creative thinking.\n<br/><br/>\nI suspect there\'s a third America: members of an increasingly radical middle that will become more obvious in the next few years, tolerant of those who are different and aware that the big problems of our times are being ignored -- or made worse -- by those in power today.\n<br/><br/>\nThat third America needs a candidate. Or, maybe, a new party.</cite></blockquote>\n<br/>\n<a href="http://jameshowardkunstler.typepad.com/clusterfuck_nation/2004/11/election_result.html">\nClusterfuck Nation by Jim Kunstler : Election Results</a>\n<blockquote><cite>\nWE need a real opposition party and so must turn our backs on the Democratic Party and give all of our energy and support to some other more radical party. Fuck Kerry and fuck Bush. Move On, George Soros, Michael Moore, Eminem and others need to abandon Democrats and join up with Socialists or Greens or somebody who is not afraid to call Republicans fascists and call them out for every dead body they produce. Democrats must go the way of the Whigs. May they rot in Hell.\n</cite></blockquote>\n\n' }
