{ layout: 'post',
  title: 'Quem são os leitores de blogs?',
  published: true,
  category: [ 'Weblogs' ],
  __content: '\n<p>\nA página <a title="Blogads: reader survey for blog advertising." href="http://www.blogads.com/survey/blog_reader_survey.html">Blogads: reader survey for blog advertising</a> contém os resultados de um inquérito feito pela <a href="http://www.blogads.com/">Blogads</a> aos leitores de uma selecção de blogs (maioritariamente americanos e virados para a política). Aqui vão alguns <a href="http://en.wikipedia.org/wiki/Factoid">factóides</a> extraídos do inquérito:\n</p>\n<ul>\n<li>\nA esmagadora maioria (79%) dos leitores de blogs é do sexo masculino</li><li>\nOs trintões constituem a faixa etária mais representativa (29%)</li><li>\nOs profissionais de informática são a ocupação mais representada (11%), seguida dos estudantes (10%)</li><li>\nCerca de 21% dos respondentes afirma ter o seu próprio blog, um número surpreendentemente alto que pode ser o resultado do viés do inquérito (ver abaixo) ou simplesmente reflectir a natureza mais participativa da blogosfera relativamente a outros média</li><li>\nEntre os blogs seleccionados, os que têm maior audiência são o <a href="http://www.drudgereport.com/">DrudgeReport</a> (81%), o <a href="http://www.instapundit.com/">Instapundit</a> (79%), o <a href="http://www.talkingpointsmemo.com/">Talkingpointsmemo</a> (77%), o <a href="http://www.dailykos.com/">DailyKos</a> (77%) e o <a href="http://atrios.blogspot.com/">Atrios</a> (75%). O Atrios lidera ainda entre os que são lidos duas vezes ou mais por dia, com 38% dos inquiridos a confessarem este grau de dependência</li><li>\nOs leitores de blogs são viciados nas compras online: 86% já comprou livros online, 64% já comprou música, 63% já comprou bilhetes de avião e 63% já contribuiu para uma causa ou campanha\n</li>\n</ul>\n<p>\nEmbora interessantes, estes resultados devem ser encarados com alguma cautela, por várias razões:\n</p>\n<ul><li>Como companhia de publicidade, o negócio da Blogads consiste em "vender" audiências a anunciantes, o que indica um potencial conflito de interesses que pode reduzir a credibilidade dos resultados.\n</li><li>Os leitores são todos provenientes de um pequeno conjunto de blogs que não constitui uma amostra representativa do universo de blogs. A amostra de blogs seleccionada é predominantemente americana e virada para a discussão de temas políticos, o que provoca uma representação provavelmente desproporcionada nos resultados do inquérito de leitores também americanos e interessados por política.\n</li><li>A amostra de leitores não é representativa, pois é <a href="http://www.takesurvey.com/surveyfaq.htm">auto-seleccionada</a> e não aleatória. Como o inquérito se baseia nas respostas dos leitores que por alguma razão se sentiram suficientemente motivados para responder ao mesmo, os resultados são válidos apenas para esse segmento da população total de leitores, não podendo ser estendidos a todo o universo de leitores de blogs.\n</li></ul> \n</p>Apesar de todas as advertências, eu próprio li os resultados do inquérito com interesse e atenção. Os resultados dizem coisas interessantes sobre um sector muito específico dos visitantes da blogosfera: aqueles que viram o anúncio ao inquérito e se sentiram suficientemente motivados para responder.<p>\n\n' }
