{ layout: 'post',
  title: 'SMS à Borla',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>Hoje precisei de enviar um grande número de SMSs. Avarento como sou, claro que tentei descobrir uma maneira de o fazer de graça. A solução foi mais simples do que esperava. Os sítios <a href="http://www.mytmn.pt/web/easysms/EasySms.po">myTMN | EasySMS</a> e <a href="https://www.optimus.pt/Site+Optimus/MassMarket/Servicos/Mensagens/sms/">Optimus | SMS</a> permitem enviar SMSs gratuitos para clientes das redes TMN e Optimus, respectivamente. Para o fazer, basta registar-se em cada um deles: No caso da TMN, basta ir a <a href="https://www.mytmn.pt/web/mytmnsecure.po?register=">myTMN | Registo</a> e fornecer o seu nome e o número do seu telemóvel da rede TMN para poder enviar até 30 SMSs gratuitos por mês para números da rede TMN. Os SMSs seguintes custam 0,10€ cada, tal como os SMSs para outras redes. No caso da Optimus, vá a <a href="https://www.optimus.pt/Site+Optimus/MassMarket/Registo/">Optimus | Registo</a> e introduza o número de um telemóvel da rede Optimus e o respectivo PIN ou PUK. A Optimus permite enviar um número ilimitado de SMSs para a rede Optimus, mas infelizmente não permite enviar SMSs para outras redes, nem sequer pagando (pelo menos foi que me disseram no atendimento ao cliente).</p>\n<p>Para reduzir as despesas, dividi os números de telemóvel para os quais queria enviar o SMS em três listas: números da Optimus, da TMN e da Vodafone. Utilizei o sítio da Optimus para enviar gratuitamente todos os SMSs para números da Optimus, e utilizei o sítio da TMN para enviar SMSs gratuitos para os números da TMN e SMSs pagos para números da Vodafone. É provável que a Vodafone tenha um serviço semelhante, mas como não tenho nenhum número desta rede móvel não me dei ao trabalho de investigar.</p>\n<p>As vantagens destes serviços não se limitam à redução de custos. Para além de ser consideravelmente mais fácil redigir um SMS complexo usando um teclado de computador, ambos os sítios permitem enviar uma mensagem para mais do que um número. O sítio da TMN permite enviar um SMS para até cinco números diferentes, enquanto que o sítio da Optimus apenas permite enviar um SMS para três números diferentes. É claro que graças ao milagre do <a href="http://www.activitiesforkids.com/printout/cutcopypaste.htm">Copy & Paste</a> nada nos impede de voltar a enviar a mesma mensagem para outros números.</p>\n\n\n' }
