{ layout: 'post',
  title: 'ADM - WMD',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>ADM: Armas de Destruição Massiça - WMD: Weapons of Mass Destruction. Duas siglas que não voltarão tão cedo a ser encaradas sem profundo cepticismo. A discussão começa a aquecer, havendo entre os apoiantes da intervenção quem comece a tirar as consequências da sua não existência. O Pacheco Pereira, sempre desejoso de preservar a sua imagem de coerência intelectual mesmo quando dói, disparou o tiro de partida, com um artigo do Público intitulado <a href="http://jornal.publico.pt/publico/2004/02/05/EspacoPublico/O01.html">Armas de Destruição Maciça: Engano Ou Mentira? (1)</a>.</p>\n\n<p>Sempre fiel a si próprio, Pacheco Pereira envia umas farpas aos cépticos:<blockquote><cite>Os que dizem que o Iraque não tinha e não tentou ter armas de destruição maciça, e que cumpriu todas as resoluções das Nações Unidas, podem fundar-se nas suas ideologias, mas nunca leram os relatórios das Nações Unidas.</blockquote></cite>É claro que os milhões que se manifestaram contra o ataque ao Iraque o fizeram por anti-americanismo. Todas as pessoas sérias deveriam obviamente ter confiado nos nossos aliados. O facto de agora descobrirmos que os nossos aliados nos enganaram é lamentável para o mundo, que tanto precisava da liderança dos EUA. O facto de o cepticismo de tantos (motivado, note-se, pela ideologia e não pelo senso comum) se ter acabado por revelar certeiro é ignorado. Isto da ideologia leva a coincidências bizarras.</p>\n\n<p>É esclarecedor notar que Pacheco Pereira considera mais grave a possibilidade de a não existência de ADM se dever a um engano dos serviços de inteligência anglo-saxónicos do que a possilidade de tal se dever a uma mentira deliberada:<blockquote><cite>Saber se houve engano ou mentira, em termos da política interna, e pela mesma razão de influência de países como os EUA e o Reino Unido, afecta a sua legitimidade junto da opinião pública democrática. Quer tenha sido engano, quer tenha sido mentira, existem efeitos, embora, neste último caso, os efeitos possam ser conjunturais. Pelo contrário, um engano desta dimensão cometido pelos melhores, e com mais meios, serviços de informação do mundo é um problema estrutural. Como é (foi) possível enganarem-se deste modo aparentemente grosseiro?</blockquote></cite>Aparentemente a fiabilidade dos serviços secretos é mais importante para Pacheco Pereira do que o legítimo direito dos povos de não serem conduzidos pelos seus dirigentes para guerras desnecessárias. É instrutivo que perante a hipótese de nos terem mentido deliberadamente, Pacheco Pereira não diga igualmente "como é (foi) possível enganarem-NOS deste modo aparentemente grosseiro?". Que lições devemos tirar se se concluir que fomos leais para com um país aliado que nos mentiu despudoramente?</p>\n\n<p>Pacheco Pereira admite a contragosto que a doutrina da guerra preventiva se tornou insustentável:<blockquote><cite>Mas, vistas bem as coisas, uma política afirmativa, assertiva, dos EUA e dos seus aliados, não será fácil de fazer nos próximos anos. Alguém se levantará e lhes dirá: "Vocês também tinham a certeza das armas..." Estão condenados a uma política defensiva - são atacados, respondem.</blockquote></cite>Ou seja, a maior potência militar do mundo está condenada ao amargo destino de aprender a viver como a maior parte dos estados do mundo. </p>\n\n<p>No entanto, Pacheco Pereira continua a defender que a guerra se justificava. Foi simplesmente mal vendida, invocando as ADM como motivo quando tal não era necessário:<blockquote><cite>Se os EUA e o Reino Unido tivessem ficado apenas pela violação das resoluções das Nações Unidas, sem avançarem eles próprios "dados" e "revelações" que davam uma ideia cataclísmica do arsenal de ADM de Saddam, que hoje se verifica ser falsa, não teriam as dificuldades que têm hoje. Mas subiram ilegitimamente a parada para um limiar em que ficaram com o ónus de uma prova que se mostraram incapazes de fornecer.</blockquote></cite>Aparentemente, o facto de as Nações Unidas não considerarem a violação das suas resoluções como motivo para invadir o Iraque é demonstrativo da sua própria ineficácia. Ou seja, os EUA foram obrigados pela casmurrice da ONU a violar a ordem internacional para defender a ordem internacional. Por detrás das palavras duras e dos modos bruscos, os EUA albergam no seu coração um grande carinho pela ONU, essa grande pateta.</p>\n\n<p>Entretanto, outros cronistas vão discutindo as consequências da não existência das ADM:<br />\nMiguel Sousa Tavares, em <a href="http://jornal.publico.pt/publico/2004/02/06/EspacoPublico/O01.html">Engano Ou Engano Voluntário (?)</a><br />\nAugusto M. Seabra, em <a href="http://jornal.publico.pt/2004/02/08/EspacoPublico/O03.html">As Armas e a Exigência Democrática</a><br />\nJoão Carlos Silva, em <a href="http://jornal.publico.pt/2004/02/08/Mundo/I02.html">A Doutrina de Guerra Preventiva Está Ferida de Morte?</a></p>\n\n' }
