{ layout: 'post',
  title: 'Office of Special Plans',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>O LA Weekly publicou esta semana uma entrevista interessante com a Tenente Coronel Karen Kwiatkowski, uma conservadora que trabalhou 20 anos na USAF. A Karen foi transferida na primavera de 2002 para um cargo no NESA -- Near East and South Asia -- uma divisão do Departamento de Estado a partir da qual o Vice-Presidente Dick Cheney e o Secretário da Defesa Donald Rumsfeld criaram o OSP -- Office of Special Plans. Segundo a Karen, o OSP levou a cabo um golpe de estado neo-conservador que pôs o Pentágono à sua merçê.</p>\n\n<p>As verdadeiras razões que motivaram os neo-conservadores a invadir o Iraque são segundo ela as seguintes:<blockquote><cite><emphasis>So if, as you argue, they knew there weren’t any of these WMD, then what exactly drove the neoconservatives to war?</emphasis></p>\n\n<p>The neoconservatives pride themselves on having a global vision, a long-term strategic perspective. And there were three reasons why they felt the U.S. needed to topple Saddam, put in a friendly government and occupy Iraq.</p>\n\n<p>One of those reasons is that sanctions and containment were working and everybody pretty much knew it. Many companies around the world were preparing to do business with Iraq in anticipation of a lifting of sanctions. But the U.S. and the U.K. had been bombing northern and southern Iraq since 1991. So it was very unlikely that we would be in any kind of position to gain significant contracts in any post-sanctions Iraq. And those sanctions were going to be lifted soon, Saddam would still be in place, and we would get no financial benefit.</p>\n\n<p>The second reason has to do with our military-basing posture in the region. We had been very dissatisfied with our relations with Saudi Arabia, particularly the restrictions on our basing. And also there was dissatisfaction from the people of Saudi Arabia. So we were looking for alternate strategic locations beyond Kuwait, beyond Qatar, to secure something we had been searching for since the days of Carter — to secure the energy lines of communication in the region. Bases in Iraq, then, were very important — that is, if you hold that is America’s role in the world. Saddam Hussein was not about to invite us in.</p>\n\n<p>The last reason is the conversion, the switch Saddam Hussein made in the Food for Oil program, from the dollar to the euro. He did this, by the way, long before 9/11, in November 2000 — selling his oil for euros. The oil sales permitted in that program aren’t very much. But when the sanctions would be lifted, the sales from the country with the second largest oil reserves on the planet would have been moving to the euro.</p>\n\n<p>The U.S. dollar is in a sensitive period because we are a debtor nation now. Our currency is still popular, but it’s not backed up like it used to be. If oil, a very solid commodity, is traded on the euro, that could cause massive, almost glacial, shifts in confidence in trading on the dollar. So one of the first executive orders that Bush signed in May [2003] switched trading on Iraq’s oil back to the dollar.</cite></blockquote>As questões das bases da Arábia Saudita e da venda de petróleo em Euros já não são novas, mas ainda não tinha ouvido falar da primeira: depois de anos de bombardeamento, e com as sanções na iminência de serem levantadas, os EUA dificilmente conseguiriam assinar contratos importantes no Iraque, sendo provável que outros países conseguissem estabelecer relações comerciais favoráveis com o país com as segundas maiores reservas de petróleo do mundo.</p>\n\n<p>[via <a href="http://www.metafilter.com/mefi/31379">MetaFilter</a>]</p>\n\n' }
