{ layout: 'post',
  title: 'Noche Vieja',
  published: true,
  category: [ 'Travel' ],
  __content: '\n<p>Passei a última semana de 2003 em Espanha, e a noite de ano novo propriamente dita em Madrid, sempre em excelente companhia. Começámos por procurar um restaurante para jantar perto da <a href="http://www.ricksteves.com/news/0008/nuns.htm">Plaza</a> <a href="http://www.madaboutmadrid.com/guide/2003/10/plaza_mayor.html">Mayor</a>, provavelmente o principal centro turístico da cidade, mas os preços eram incomportáveis, oscilando entre os €87 e os €100 por pessoa.</p>\n\n<p>Continuámos à procura, até que desembocámos na simpática <a href="http://www.wguides.com/city/11/150_23523.cfm">Plaza</a> <a href="http://membres.lycos.fr/visitedemadrid/plazadelapaja.htm">de la Paja</a>, no bairro La Latina, onde vimos um pequeno restaurante que destoava da solidão do resto da praça. Entrei temendo o pior, mas os €36 pedidos por cabeça no restaurante russo <a href="http://www.gomadrid.com/rest/cosaco.html">El Cossaco</a> eram mais comportáveis que a oferta até aí encontrada. Além do mais, o restaurante tinha um aspecto muito acolhedor, com luzes suaves e uma agradável decoração com motivos russos, e havia exactamente uma mesa disponível. Avisaram-nos logo que o restaurante fechava às 11h, mas como já tinhamos planeado passar o ano na <a href="http://www.madaboutmadrid.com/guide/2003/09/puerta_del_sol.html">Puerta</a> <a href="http://www.softdoc.es/madrid_guide/maps/soldes.html">del Sol</a> não nos pareceu obstáculo de maior. A escolha mostrou ser mais do que acertada.</p>\n\n<p>O menu consistia numa entrada de Blinis (panquecas russas) acompanhados de deliciosos caviares e peixes fumados, seguida de um prato principal, a escolher entre o clássico bife Strogonoff e o menos conhecido bife Woronoff. Escolhi o segundo, que estava de-li-ci-o-so! Depois vieram as sobremesas, escolhidas entre tarte quente de requeijão e passas e tarte de mousse de chocolate. Escolhi o segundo, mas acabei por lamentar não ter escolhido a tarte de requeijão, que estava excelente. Finalmente veio uma rodada de vodka forte com sabor a fruta, e por esta altura já estávamos quase sozinhos no restaurante, que estava em fase avançada de encerramento. A refeição foi acompanhada por um excelente vinho tinto espanhol cujo nome infelizmente não fixei. Deixámos o restaurante com o corpo e a alma bem aquecidos, e prontos para enfrentar a passagem de ano.</p>\n\n<p>Chegámos à Porta do Sol por volta da 23h30, e apesar de os acessos já estarem bastante congestionados conseguimos chegar praticamente ao centro da praça, que estava apinhada de gente. Apesar de a coisa parecer prometedora, a passagem de ano acabou por ser algo decepcionante: tirando alguns saltimbancos que apareceram no topo de alguns edifícios e de um ou outro foguete lançado pela multidão, não houve qualquer animação organizada: nem fogo de artifício, nem sequer música. O resultado foi que depois de muito grito e muito pulo durante os primeiros minutos de 2004 as pessoas começaram lentamente a abandonar a praça. Acabámos por fazer o mesmo para rumar em direcção à Plaza Mayor.</p>\n\n<p>A praça continuava repleta das <a href="http://www.madaboutmadrid.com/guide/2003/12/christmas_marke.html">barracas</a> que durante os últimos dias tinham servido para vender "artículos de broma", incluindo os hediondos barretes de natal, vermelhos ou laranjas, que se espalharam como parasitas pelas cabeças de praticamente toda a população de Madrid, para aparente regozijo da mesma. Felizmente que as barracas estavam agora fechadas, mas não deixaram de transformar esta praça normalmente ampla num local apertado. Para tal contribuíram também as bancadas misteriosamente erigidas no último dia de 2003, não se percebendo a que fim se destinavam, pois estavam viradas para as barracas, não havendo espaço para encenar fosse que evento fosse. Acabámos por regressar ao hotel onde estavámos hospedados relativamente cedo.</p>\n\n<p>Talvez estivéssemos mal informados ou tenhamos tido azar, mas a passagem de ano em Madrid foi relativamente decepcionante, ao contrário do resto da estadia em Madrid.</p>\n\n' }
