{ layout: 'post',
  title: 'Armas de Descredibilização Massiça',
  published: true,
  category: [ 'Current Affairs' ],
  __content: '\n<p>A entrevista da <a href="http://olifante.blogs.com/covil/2004/02/office_of_speci.html">entrada anterior</a> gerou uma <a href="http://www.metafilter.com/mefi/31379">discussão muito viva</a> no MetaFilter, na qual surgiram alguns apontadores para vários textos recentes muito interessantes. Aqui vão os apontadores para alguns deles:</p>\n\n<p><a href="http://www.foreignpolicy.com/story/cms.php?story_id=2442&print=1">Iraq\'s False Promises</a> por Slavoj Zizek no Foreign Policy<blockquote><cite>If you want to understand why the Bush administration invaded Iraq, read Freud’s Interpretation of Dreams, not the National Security Strategy of the United States. Only the twisted logic of dreams can explain why the United States thinks that the aggressive pursuit of contradictory goals—promoting democracy, affirming U.S. hegemony, and ensuring stable energy supplies—will produce success. </cite></blockquote><a href="http://www.washingtontimes.com/functions/print.php?StoryID=20040209-090308-2252r">Iraq and the Gulf of Tonkin</a> por Arnaud de Borchgrave no Washington Times<blockquote><cite>The dust is not about to settle over the intelligence failure in Iraq. But it has already blurred our vision about weapons of mass destruction (WMDs).<br />\nThere is still time to remind ourselves WMDs were not the principal reason for going to war against Saddam Hussein\'s Iraq; they were the pretext. And that\'s why irrefutable evidence was not the standard. Axis of evil regime change was the lodestar.<br />\nWhen this writer first heard from prominent neoconservatives in April 2002 that war was no longer a question of "if" but "when," the casus belli had little to do with WMDs. The Bush administration, they explained, starkly and simply, had decided to redraw the geopolitical map of the Middle East. The Bush Doctrine of pre-emption had become the vehicle for driving axis of evil practitioners out of power. </cite></blockquote><a href="http://www.nybooks.com/articles/16378">The Neocons in Power</a> por Elizabeth Drew no New York Review of Books<blockquote><cite>The conflict within the Bush administration in recent months over policy for postwar Iraq has caused much confusion and has already damaged the reconstruction effort. The stakes are enormous not just for the US and for the people of Iraq, but for the entire Middle East, and the rest of the world. Almost from the outset of the Bush administration there have been battles between the State Department and the Defense Department, but the controversy over postwar Iraq has brought out bitterness and knife-wielding of a sort that Washington has seldom seen.</cite></blockquote><a href="http://www.nybooks.com/articles/16922">Now They Tell Us</a> por Michael Massing no New York Review of Books<blockquote><cite>In recent months, US news organizations have rushed to expose the Bush administration\'s pre-war failings on Iraq. "Iraq\'s Arsenal Was Only on Paper," declared a recent headline in The Washington Post. "Pressure Rises for Probe of Prewar-Intelligence," said The Wall Street Journal. "So, What Went Wrong?" asked Time. In The New Yorker, Seymour Hersh described how the Pentagon set up its own intelligence unit, the Office of Special Plans, to sift for data to support the administration\'s claims about Iraq. And on "Truth, War and Consequences," a Frontline documentary that aired last October, a procession of intelligence analysts testified to the administration\'s use of what one of them called "faith-based intelligence." </cite></blockquote><a href="http://www.nytimes.com/aponline/national/AP-Intelligence-Congress.html?ex=1393045200&en=be567b8188ada0b2&ei=5007&partner=USERLAND">Tenet: al-Qaida Weakened, Extremism Isn\'t</a> no New York Times</p>\n\n<p><a href="http://www.iacenter.org/dismem.htm">IS THE U.S. ATTEMPTING TO DISMEMBER IRAQ?</a> por Richard Becker, do International Action Center</p>\n\n<p><a href="http://www.wsws.org/articles/2003/nov2003/gelb-n26.shtml">The New York Times: a proposal for ethnic cleansing in Iraq</a> por Bill Vann no World Socialist Web Site</p>\n\n<p><a href="http://www.govexec.com/news/index.cfm?mode=report2&articleid=27607&printerfriendlyVers=1&">  Former Iraq administrator sees decades-long U.S. military presence</a> por Amy Svitak Klamper no CongressDaily</p>\n\n<p><a href="http://www.casi.org.uk/info/usdocs/usiraq80s90s.html">U.S. Diplomatic and Commercial Relationships with Iraq, 1980 - 2 August 1990</a> por Nathaniel Hurd</p>\n\n' }
