{ layout: 'post',
  title: 'Mini-Guia de Barcelona',
  published: true,
  category: [ 'Travel' ],
  __content: '\n<p>Amanhã o Sr. e a Sra. Olifante partem na companhia do M &amp; A para uma escapadela de fim-de-semana a Barcelona. Conseguimos bilhetes a cerca de 100€ com a low-cost espanhola <a href="http://www.vueling.com/EN/index.php?mode=">Vueling</a>, mas descobrimos depois que era possível obter preços ainda melhores com a <a href="http://www.flypga.com/">Portugália</a>... Uma amiga nossa que vive em Barcelona há vários anos, a Rita, está determinada em ajudar-nos a tirar o melhor partido desta nossa mini-estadia. Embora inicialmente tenha dito &quot;dois dias não dá para ver nada, o melhor é simplesmente respirar o ambiente&quot;, enviou-nos hoje um email repleto de dicas. Como a Rita é tão divertida a escrever como em pessoa, não resisto a publicar aqui este mini-guia (com ligeiras alterações de formatação):</p><blockquote><p><span style="color: #330099;">Aqui vão algumas sugestõezinhas só para aguçar o dente. A oferta cultureta urbanita não é lá grande coisa para este fds. Dommage!! Amanhã vou ver se vos consigo arranjar o <strong>&quot;Que Fem?&quot;</strong> que é talvez a melhor forma de saber o que é que se coze na cidade. No entanto, vou deixar-vos umas dicas sobre os bairros mais carismáticos:<br /><br /><strong>CENTRO HISTÓRICO (o casc antic, d\'acord?):</strong><br /><br /><strong>Bairro do Raval</strong> (descendo as Ramblas do lado direito): é o talvez o bairro mais moderno-cool do momento. </span></p>\n\n<p><span style="color: #330099;">Vale a pena perder-se e dar uma vista de olhos ao<strong> MACBA - Museu de Arte Contemporânea</strong> - que é um petit elefante branco mas com volumetrias mais sugestivas e as expo itinerantes costumam ser muito boas. </span></p>\n\n<p><span style="color: #330099;">Na mesma praça está o <strong>Convent dels Angels</strong> onde normalmente fazem exposições de design interessantes, mais não seja porque como não se paga, não se perde nada.</span></p>\n\n<p><span style="color: #330099;">De aqui podem ir também à <strong>Rambla do Raval</strong>, uma rambla recém-estreada (2/3 anos) e que mudou radicalmente a vida do bairro que se abriu à cidade; antes, há uns 5 anos atrás, o Raval ou Barrio Chino era impenetrável.</span></p>\n\n<p><span style="color: #330099;">Se estiverem com fome e o estômago reclamar umas tapinhas óptimas, dirijam-se ao <strong>Mercado da Boqueria</strong>, que está mais ou menos a meio das Ramblas, descendo do lado dto., perto da ópera (Liceu). O bar que vos digo está mesmo perto da entrada principal do lado esquerdo. Não recordo como se chama.</span></p>\n\n<p><span style="color: #330099;">Do outro lado das Ramblas, na rua Cardenal Casañas (como quem vai das ramblas, em frente ao Liceu, em direcção à praça do Pi) há uma taverna basca que se chama <strong>Irati</strong> que tem uns &quot;pinchos&quot; (tapas bascas tipo espetada) óptimos. O problema é que têm que comer de pé.</span></p>\n\n<p><span style="color: #330099;">A partir de aqui já estão a entrar no <strong>BAIRRO GÓTICO</strong> onde podem visitar a <strong>Catedral</strong> e arredores, tomar um café na esplanada do hotel da <strong>Praça S. Neri</strong> e dar um salto à <strong>Praça St Jaume</strong> (onde co-habitam o Generalitat e o Ajuntament).</span></p>\n\n<p><span style="color: #330099;">A <strong>CIUTAT VELLA</strong> é o bairro que fica para baixo da Calle Ferran, onde podem visitar a <strong>calle Avignó</strong> (compras), <strong>Praça Georges Orwell</strong>, mais conhecida por Praça del trippie, vá-se lá saber porquê) e seguindo pela C/ Escudellers regressam às Ramblas. A <strong>Praça Real</strong> está mesmo ao lado.<br /><br />Seguindo pelas Ramblas em direcção ao mar vão encontrar o Cristovão ... Colombo. À direita está o <strong>Museu del Mar</strong> onde pelos vistos há um bar tipo chill-out enorme e muita giro (eu ainda não fui) onde podem descansar os corpinhos. <br /><br />Se optarem pela direcção contrária, <strong>Passeig Colom</strong>, vão dar ao final da Via Layetana. Se forem em frente vão dar ao Born, se optarem pela direita (na direcção da estátua que o Miró fez para a Olimpíadas) vão dar à Barceloneta (antigo bairro dos pescadores, em plena recuperação)<br /><br /> O <strong>Born</strong> já foi um bairro giríssimo mas está a perder o carisma porque se tornou um bairro demasiado cool. Mas vale a pena a visitar:</span></p>\n\n<ul><li><span style="color: #330099;"><strong>Igreja Santa Maria del Mar:</strong> na praça que dá para a porta principal há um bar cujo nome não recordo agora, mas é tipo uma &quot;bodega&quot; fina de 2 andares e com mesas cá fora. É ideal para tomar um vinho e saborear uns queijos, tacos (nacos) de salmão e olives (azeitunas). </span></li>\n\n<li><span style="color: #330099;"><strong>O museu Picasso:</strong> Se gostam de anchovas, na Rua do Museu há um sitio que se chama Xampanyet que tem as melhores anchovas da cidade, mas acho que só está aberto ao meio-dia e ao final da tarde. Aos domingos não sei se abrem. Quase em frente, está a casa do Pais Vasco onde podem comer uns &quot;pinchos&quot; óptimos e aqui sim podem-se sentar.</span></li>\n\n<li><span style="color: #330099;"><strong>Praça del Mercat del Born:</strong> que vai ser reformado para alojar uma biblioteca flutuante (descobriram umas ruínas romanas)</span></li>\n\n<li><span style="color: #330099;"><strong>Parc de la Ciutadella:</strong> parque da cidade. Não é nada de especial mas podem-se espreguiçar à vontade na relva.</span></li></ul>\n\n<p><span style="color: #330099;">A <strong>Barceloneta</strong> está do lado esquerdo de quem desce pelo passeio Joan de Borbó. Como bairro não tem nada de especial e a praia que está do outro lado é uma praia de cidade. O passeio marítimo é agradável e leva-vos à cidade Olímpica que para além do Hotel Arts, é uma zona bastante bimba. Fuge, fuge!!<br /><br />Mais sugestões:</span></p>\n\n<ul><li><span style="color: #330099;">A <strong>Praça Catalunya</strong> e o magnífico <strong>Passeig da Gràcia</strong> (onde estão a <strong>Casa Batllò</strong> e a <strong>Pedrera,</strong> ambas obras do Gaudi)</span></li>\n\n<li><span style="color: #330099;">A não perder também a <strong>Casa Vinçon</strong> logo a seguir à Pedrera; é uma loja muito curiosa e o andar de cima, q é a secção de móveis, é digno de uma visita).</span></li>\n\n<li><span style="color: #330099;">O Passeig da Gràcia continua pela rua Gran de Gràcia que vos abre as portas ao <strong>bairro da Gràcia</strong>, do lado direito, o feudo burguês de Barcelona. É um bairro que tem imensas pracinhas (recomendo a de Rius y Taulet, Virreina y a mítica del Sol) mas afasta-vos muito do centro. Talvez para a próxima.</span></li>\n\n<li><span style="color: #330099;"><strong>A Sagrada família</strong> está mesmo aqui ao lado de casa. Eu pessoalmente não sou fã, mas deve visitar-se.</span></li></ul>\n\n<p><span style="color: #330099;">Uma opção se tiverem mesmo com vontade de ter uma visão global da cidade é apanhar o autocarro turístico (acho que se pode apanhar na praça da catalunya e em vários outros pontos, o melhor é perguntarem no hotel). Parece foleiro mas não é. Eu já fiz o percurso com os meus pais, e com excepção do Camp Nou, gostei bastante. É muito cansativo tb.<br /><br />Vou-vos deixar mais algumas sugestões para &quot;cumer e buber&quot;:</span></p>\n\n<ul><li><span style="color: #330099;"><strong>Sikkim:</strong> Plaza Comercial,1 (Born).&nbsp; 93 268 43 13. Oriental-mediterrânea.</span></li>\n\n<li><span style="color: #330099;"><strong>L\'Oucomballa:</strong> Banys Vells, 20 (Born). 93 310 53 78. Inspiração grega/marroquina.</span></li>\n\n<li><span style="color: #330099;"><strong>Ra:</strong> Praça por detrás da Boqueria. Cozinha internacional</span></li>\n\n<li><span style="color: #330099;"><strong>Lupino:</strong> ao lado do Ra. Hiper-mega-hype</span></li>\n\n<li><span style="color: #330099;"><strong>Andaira</strong> (restaurante do Karl): é óptimo. Cozinha de autor - <a href="http://www.andaira.com">www.andaira.com</a> - Fica na Calle Vilajoyosa 52, na Barceloneta, na marginal (peatonal) em frente à praia. </span></li>\n\n<li><span style="color: #330099;"><strong>Fortuny:</strong> Calle Pintor Fortuny 31, Zona MACBA. Come-se bastante bem (cozinha mediterrânea) e não é caro. </span></li>\n\n<li><span style="color: #330099;"><strong>Verónica:</strong> Pizzaria. Ideal para o dia depois. Praça George Orwell, mais conhecida como Praça del Trippie (Bairro Gótico)</span></li>\n\n<li><span style="color: #330099;">Perto do Verónica, na Calle Avinyó há um restaurante modernista (não me lembro o nome, Gran Café ou algo parecido) onde tb se come muito bem.</span></li>\n\n<li><span style="color: #330099;"><strong>Les quinze nits:</strong> Praça Real. Cozinha mediterrânea, relação qualidade-preço muito equilibrada.</span></li></ul>\n\n<p><span style="color: #330099;">Estes 2 sites também têm info sobre a movida em Barna: <a href="http://www.lecool.com">www.lecool.com</a> e <a href="http://www.salirenbarcelona.com/">www.salirenbarcelona.com</a>.<br /><br />Mais restaurantes: (que recuperei de outro mail)<br /><br /><strong>Catalan Food:</strong></span></p>\n\n<ul><li><span style="color: #330099;"><strong>Café de L\'Academia</strong> (not open on weekends). Must book: 93 315 00 26. Address: C/ Lledó, 1 (At plaza Sant Just, quite near Plaza Sant Jaume).</span></li>\n\n<li><span style="color: #330099;"><strong>Cal Boter:</strong> in the neighbourhood of Gracia. Must book: 93 458 84 62. Address: C/ Tordera, 6 (Corner with Bailén)</span></li>\n\n<li><span style="color: #330099;"><strong>Els Quatre Gats:</strong> typical old Catalan restaurant, where artists and philosophers used to meet. Must book:93 302 41 40. Address: Montsió, 3 bis (quite near Plaça Catalunya). </span></li>\n\n<li><span style="color: #330099;"><strong>La Fonda</strong> (C/ Escudellers, 10) and <strong>Les Quinze Nits</strong> (Plaça Reial, 6): Catalan food, quality/price very good. Must queue so it\'s important to arrive early.</span>&nbsp; </li></ul>\n\n<p><strong><span style="color: #330099;">Tapas:</span></strong><br /> </p>\n\n<ul><li><span style="color: #330099;"><strong>Cal Pep:</strong> Worth trying. Maybe the best tapas bar in Barcelona. Must book: 93 310 79 61/ 93 319 61 83. Pl. de les Olles, 8 (Between Plaça Sta. Mº del Mar and Avda. Marqués de Argentera).</span></li>\n\n<li><span style="color: #330099;"><strong>Jaica:</strong> very good tapas on La Barceloneta. C/ de Ginebra.</span></li>\n\n<li><span style="color: #330099;"><strong>Irati:</strong> tapas from the Basque Country. Very good. They have also restaurant. Cardenal Casañas, 17( Between La Rambla and Plaza Sant Josep Oriol) (93 302 30 84).</span></li></ul>\n\n<p><strong><span style="color: #330099;">Fish and seafood:</span></strong><br /> </p>\n\n<ul><li><span style="color: #330099;"><strong>Can Costa:</strong> Paseo Joan de Borbó, 70 (93 221 42 62). It\'s advisable to book.</span></li>\n\n<li><span style="color: #330099;"><strong>Barceloneta:</strong> Escar, 22 (Moll dels Pescadors) (93 221 21 11). It\'s advisable to book. </span></li>\n\n<li><span style="color: #330099;"><strong>Cal Pintxo:</strong> Baluard, 124</span></li></ul>\n\n<p><strong><span style="color: #330099;">Posh and classic restaurant:</span></strong><br /> </p>\n\n<ul><li><span style="color: #330099;"><strong>Bota Fumeiro:</strong> C/ Mayor de Gracia, 81 (93 218 42 30/ 93 217 96 42)</span></li></ul>\n\n<p> <span style="color: #330099;"><br />Bon apetit!!</span></p></blockquote><p>Obrigado!</p>\n\n' }
