{ layout: 'post',
  title: 'Interview Meme',
  published: true,
  category: [ 'Weblogs' ],
  __content: '\n<p><a href="http://www.livejournal.com/users/strangehours/32064.html">Tobias Sargeant</a> is trying to jumpstart a new meme. The idea is that people can leave a message in for instance my blog asking to be interviewed by me, the catch being that I then get to choose the five questions that are to be answered.</p>\n\n<p>He picked up my comment in his LiveJournal and gave me five questions. Here they are, along with my answers:</p>\n\n<p><b>1) I\'m curious: how did you find this post, and why did you decide you wanted to be interviewed by a complete stranger?</b></p>\n\n<p>Your blog has been in my bloglines blogroll for some time. I guess I imported it because it was listed along with a bunch of other Python blogs. I wanted to be interviewed by someone else because frankly writing monologues and rants only takes you so far. When I started my blog, I hoped it would become a catalyst for conversations, interesting conversations with interesting strangers. So far I must admit I haven\'t done terribly well in that regard.</p>\n\n<p><b>2) You say (I think) that you never want to learn objective-c, and yet you use a mac, and program in Python. What turns you off objective-c?</b></p>\n\n<p>I don\'t remember if I ever said anything about Objective-C, but the reason I wasn\'t thrilled by it is that it is still C, i.e. it forces you to do manual memory management. I never really became fluent in either C or C++, so I try to avoid the paths that involve mastery of even a subset of those two languages. However, I have recently learned Smalltalk (the Squeak version), and I was flabbergasted. What an amazing language! Maybe I\'ll revise my opinion and learn Objective-C anyway, but my money for MacOSX tinkering is on the Python bridge, Bob Ippolito\'s extraordinary PyObjC, which I hope Apple will eventually officially bless.</p>\n\n<p><b>3) Do you have any opinion on Australia\'s current and Portugal\'s historical relationship with East Timor?</b></p>\n\n<p>I was badly impressed by the Australian government\'s selfish attitudes towards Timor before the independence, kow-towing to Indonesia across the board. Admittedly, Australia has atoned for this attitude quite a lot since E. Timor became independent, but the recent strong-arm tactics in the Timor gap negotiations show that playing nice still isn\'t a major element in Australia\'s foreign policy. I have also been terribly disappointed by Australia\'s support for the war on Iraq, but my country also jumped on that bandwagon, so I can\'t really point the finger.</p>\n\n<p><b>4) What do you think is Portugal\'s best aspect? Its worst?</b></p>\n\n<p>Best aspects: we\'re tolerant, flexible, open-minded and resourceful. Worst aspects: we\'re too undemanding of ourselves and others, worry too much about what others think, and we are too ennamored of caustic, destructive criticism. Did I mention Portugal is a wonderful country? And Lisbon a beautiful city? You should come visit some time.</p>\n\n<p><b>5) What\'s your favourite Greg Egan novel, and what similar writers would you recommend?</b></p>\n\n<p>I think I only read Greg Egan\'s Permutation City, which I loved. It falls short of being a great novel - I think the story loses steam and consistency halfway through. It is however filled to the brim with amazing ideas taken to astonishing extremes, and I thoroughly enjoyed this book for that reason. Egan is a brilliant and imaginative man, an intellectual dreamer\'s dreamer, and I certainly hope to read more of his books. As for similar writers, I think Neal Stephenson is exploring some of the same ideascape in his books Diamond Age and Snow Crash, with an additional nanotech angle. Although not one my favorite writers, in his Gateway series Frederik Pohl also explores some of the same ideas regarding Artificial Intelligence, Artificial Human Intelligence, mind-uploading, etc. By the way, I always mix up the two Gregs, and Greg Bear is also a great writer. His novel "Eon" is probably the most mind-expanding hard sci-fi I\'ve read in the last few years. Stephen Baxter\'s "Flux" is also a great novel (set in a neutron star), although I\'ve been disappointed by some of his other books.</p>\n\n<p>That\'s it for now. This was fun, but I\'ve gotta go pack my bags for my wedding trip to China.</p>\n\n' }
