{ layout: 'post',
  title: 'Startup School',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>On September 8, I was casually reading one of Paul Graham\'s many eloquent essays when I noticed a link with the text <a href="http://startupschool.org/">Startup School</a>. I arrived at a simple page that said:</p><blockquote>\n<p>Are you a <a href="http://paulgraham.com/gba.html">hacker</a> \nwho has thought about one day starting a startup?\nThen you\'re invited to a free, one-day startup school this October 15\nin Cambridge, Massachusetts.\n</p>\n\n<p>We\'ll have range of <a href="http://startupschool.org/speakers.html">experts</a> \nspeaking on all the things you need to\nknow to start a company: where to get ideas for startups;\nwhat to look for in a co-founder; how to get funding; how to \nincorporate a company; patent and intellectual property law;\nhow to build something users will like; what can go wrong in a\nstartup; what acquirers look for; and how the acquisition process\nworks.\n</p>\n</blockquote>\n<p>I skimmed the text and had to think all of 5 seconds before I found my self filling the application form with my nano-CV:</p>\n\n<p><a href="http://olifante.blogs.com/photos/uncategorized/startupschool_application_blur_1.png"><img border="0" src="http://olifante.blogs.com/photos/uncategorized/startupschool_application_blur_1.png" title="Startupschool_application_blur_1" alt="Startupschool_application_blur_1" class="image-full" style="margin: 0px 5px 5px 0px;" /></a></p>\n\n<p>I then promptly forgot about it, until last September 27, when an email arrived which started</p><blockquote><p> &quot;Thanks for applying to the startup school.&nbsp; We\'re happy to report you\'ve been accepted.&quot;</p></blockquote><p>Tears of joy ran down my cheeks - well, actually they didn\'t, but I was really thrilled to discover I was one of the lucky 500 people selected for this unique and FREE event. I booked a flight from Lisbon to Boston&nbsp; that same day - now I just have to find somewhere to sleep in Boston from Oct 14 to Oct 17.<br /> </p>\n\n' }
