{ layout: 'post',
  title: 'China Miéville',
  published: true,
  category: [ 'Books' ],
  __content: '\n<p>The Believer has a great <a href="http://www.believermag.com/issues/200504/interview_mieville.php" title="The Believer - Interview With China Miéville">Interview With China Mieville</a>. The focus is on his latest novel, &quot;Iron Council&quot;, which I still haven\'t read. I\'m waiting for Bruno to lend it to me ;-). Here are some excerpts from the interview:</p><blockquote><p>[...] I am completely a geek. I find it very interesting entering my\nthirties, because the early thirties basically seems to be the era of\nthe revenge of the geek, when those of us who didn’t have particularly\nexciting teenage years because we were too busy obsessively collecting\ncomics and playing Dungeons &amp; Dragons suddenly start running the\nworld</p>\n\n<p>[...]</p>\n\n<p>The thing about genre fantasy is that it is its own end, but it also does that job of symbolizing. I think about something like <em>Gulliver’s Travels.</em>\nThe figures of the Lilliputians are partly a way for Gulliver to\noverlook society from a godlike height and to make satirical, symbolic\ncomments, but it’s also, “Hey look, little tiny people! How cool!”</p>\n\n<p>[...]</p>\n\n<p>I remember someone saying once that they really hated my books because\nthey weren’t “inspiring,” but I just can’t get with this idea that\nliterature is a twelve-step program. If someone wants to read a book to\nfeel better, and the way they want to feel better is to see that the\ngood people get rewarded and the bad people get punished, that’s fine,\nbut essentially what they want then is a fairy tale.</p></blockquote><p>I bought &quot;Perdido Street Station&quot; (PSS) around 3 years ago, after reading scores of rave online reviews. It didn\'t just meet my expectations - it utterly blew them away.</p>\n\n<p>In PSS, only his second major novel after &quot;King Rat&quot;, Miéville disregards genre boundaries and seamlessly blends Sci-Fi, Fantasy and Horror into a single style which he names &quot;Weird Fiction&quot;.</p>\n\n<p>PSS is set in the city of New Crobuzon, in the world of Bas-Lag, and the city itself plays a major part in the story. Its presence is constantly felt, heavy, poisonous and suffocating. PSS falls in the category of world-building books largely created by Tolkien\'s Lord of the Rings. But whereas Tolkien\'s books are systematic, always trying to feed you more detailed descriptions of past events, Miéville has a far more sophisticated approach. Bas-Lag is a world you slowly discover through scattered comments, and Miéville makes sure you always feel like your vision is clouded, distorted and partial, as if you\'d just stumbled into his world.</p>\n\n<p>Miéville is also a much better stylist than Tolkien. His prose is exuberant and dense, often peppered with strange, exotic\nwords which help convey a sense of disorientation. Most of all, the story is fast-paced and compelling, at times terrifying. A\npage-turner if there ever was one, I was amazed to find I was actually\nscared by PSS: In one of the main scenes, when the major characters\nenter the things\' nest, my heart thumped heavily for several pages. </p>\n\n<p>PSS is one of the best books I\'ve ever read, and certainly the most exciting Sci-Fi/Fantasy/Horror/Whatever book I\'ve read in the last 10 years. Even if PSS were the only book Miéville ever wrote, it would have been enough to firmly place him on the pantheon of major writers. Fortunately it seems Miéville intends to keep on writing, let\'s hope his other books prove as worthwhile.</p>\n\n' }
