{ layout: 'post',
  title: 'Firefox as Web OS',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>On <a title="ZopeZen - Who cares about OS" href="http://www.zopezen.org/Members/andy/news_item.2005-02-15.9124827052">Who cares about OS</a>, Andy McKay talks about the fact that the choice of OS is becoming increasingly irrelevant. I couldn\'t agree more.</p>\n\n<p>I guess working for Sun Microsystems got me over my Windows addiction. Five years of daily Solaris use for every single computing task made me learn and gradually love many alternative tools, most of them free/open source. Maybe that\'s the reason why the switch to MacOSX was so painless for me: I didn\'t get a hangover from my missing toys, since I was able to take them with me to my shiny new OS.</p>\n\n<p>The browser and mail client have replaced Word and Excel as the applications I use the most. I confess I still use Mail.App instead of Thunderbird, but that\'s mostly for convenience. Mail.App is a very advanced mail client, and excellent as Thunderbird is, it didn\'t exist when I moved to MacOSX, and Mozilla was shite on MacOSX. In spite of Apple\'s Safari being an excellent browser, I still\nprefer Firefox, mostly due to its utter extensibility and most of all its portability. Firefox is excellent on Windows but also runs admirably well on other systems.</p>\n\n<p>The last few months I\'ve been teaching several Sun classes using Solaris machines for trainer and trainees alike. Installing Firefox on Solaris is a snap: get the correct archive from <a href="http://sunfreeware.com/mozilla.html">http://sunfreeware.com/mozilla.html</a>, and a &quot;tar xvf firefox-1.0-sparc-sun-solaris2.8.tar.gz&quot; later you\'re set to go.</p>\n\n<p>Of course, life in Firefox-land would be drab and meaningless without my favorite <del>applications</del> <a href="https://update.mozilla.org/extensions/?os=Windows&amp;application=firefox">extensions</a>. Fortunately, all of my must-have extensions run without problems on Windows, MacOSX and Solaris:</p>\n\n<ul><li>Adblock (don\'t forget to add the <a href="http://aasted.org/adblock/viewtopic.php?t=284">advanced filters</a>, especially the <a href="http://www.geocities.com/pierceive/adblock/">dailies</a>)</li>\n\n<li>Mouse Gestures (made me love the mouse again)</li>\n\n<li>Mozilla Amazon Browser (amazing example of the power of XUL)</li>\n\n<li>Web Developer</li>\n\n<li>Gmail Notifier</li>\n\n<li>Google Pagerank Status</li>\n\n<li>googlebar</li>\n\n<li>Download Statusbar</li>\n\n<li>downTHEMall!</li>\n\n<li>Tabbrowser Preferences</li>\n\n<li>TargetAlert</li></ul>\n\n<p>On Solaris I still haven\'t tested other extensions I enjoy, like Linkification, Slogger, Magpie, del.icio.us, Live HTTP Headers, ViewSourceWith, ConQuery and CookieCuller, but since extensions are written in standard Javascript + XUL, there\'s every reason to expect them to perform correctly.</p>\n\n<p>The other applications I spend significant time using are:</p>\n\n<ul><li>iTunes (best music player/organizer on any platform, bundled with MacOSX)<br />\n</li>\n\n<li>iCal (calendar application bundled with MacOSX)</li>\n\n<li>Address Book (contact manager bundled with MacOSX)</li>\n\n<li>iChat (instant messaging client bundled with MacOSX)</li>\n\n<li>iPhoto (excellent photo organizer bundled with MacOSX)<br />\n</li>\n\n<li>Terminal (bundled with MacOSX)</li>\n\n<li>Preview (pdf viewer bundled with MacOSX)</li>\n\n<li>Adobe Acrobat Reader (free pdf viewer)</li>\n\n<li>zsh (open source shell on steroids)<br />\n</li>\n\n<li>Python (open source programming language - batteries included!)<br />\n</li>\n\n<li>Vim (open source text editor - hate it then love it)</li>\n\n<li>Drawbot (fun open source programmable planar graphics with python)</li>\n\n<li>Quicksilver (unbelievably wonderful free program switcher!)</li>\n\n<li>Acquisition (excellent shareware gnutella client, most enjoyable P2P client for ANY platform)</li>\n\n<li>Azureus (open source BitTorrent client)</li>\n\n<li>iGetter (download manager)</li>\n\n<li>iEatBrainz (free mp3 identifier)</li>\n\n<li>Colloquy (free IRC client)</li>\n\n<li>MPlayer OS X 2 (free movie player)</li>\n\n<li>VLC (free movie player)</li></ul>\n\n<p>Not all of these are multi-platform, but of those that are, most are free, like iTunes (Windows and MacOSX only), Adobe Acrobat Reader, zsh, python, Vim, Drawbot, Azureus, MPlayer and VLC. The other applications usually have some free equivalent in other operating systems.</p>\n\n' }
