{ layout: 'post',
  title: 'Pattern links',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p>Last week I taugh a 4-day Sun training course: <a href="http://www.sun.com/training/catalog/courses/SL-425.xml">Architecting and Designing J2EE Applications</a>. This course introduces a development methodology called SunTone, which is basically a variation of the Rational Unified Process centered around J2EE and with a higher emphasis on pattern use. At the end of the course, I gave my students a list of hopefully useful links:</p>\n\n<p>The two founding tomes of pattern literature are:</p>\n\n<ul><li><a href="http://www.amazon.com/exec/obidos/tg/detail/-/0201633612/102-4255609-9112933?v=glance">Design Patterns</a>, aka the GoF or Gang-or-four book, published in 1995 and centered on design patterns. The style is terse, and the examples are given in Smalltalk and C++. Not the most accessible of books;</li>\n\n<li><a href="http://www.amazon.com/exec/obidos/tg/detail/-/0471958697/102-4255609-9112933?v=glance">Pattern-Oriented Software Architecture, Volume 1: A System of Patterns</a>, aka the PoSA book, published in 1996. This book offers a classification of patterns into architecture patterns, design patterns and implementation patterns.</li></ul>\n\n<p>Vico.org has a page called <a href="http://www.vico.org/pages/PatronsDisseny.html">Padrones de Diseño</a> (title in Spanish, URL in Catalan, content in English) that presents detailed explanations for several patterns from both books, including simple UML diagrams of the patterns and some sample code. They also have a list of <a href="http://www.vico.org/pages/Sitios_www/vico_sitios_Patterns.html">useful pattern links</a>.<br /> </p>\n\n<p><a href="http://www.amazon.com/exec/obidos/ASIN/0321127420/104-4049655-7455156">Patterns of Enterprise Application Architecture</a>, published in 2002, is another accessible Martin Fowler book and a good introduction to several architecture patterns and concepts that can now be considered mainstream. As he says in the intro, this is not a book of new ideas. However, those new to system architecture will find this a pleasant and digestible read. Check out <a href="http://www.martinfowler.com/eaaCatalog/">Catalog of Patterns of Enterprise Application Architecture</a> for a list of the patterns discussed in this book, and be sure to check his <a href="http://martinfowler.com/articles.html">Articles</a> if you haven\'t yet.</p>\n\n<p>The book <a href="http://www.netobjectives.com/dpexplained/">Design Patterns Explained: A New Perspective on Object-Oriented Design</a> introduces a few select patterns. I\'ve lent this one to several CompSci people who all enjoyed it, and it was the first book that made me feel comfortable with the fundamental design patterns.<br /> </p>\n\n<p>Another introductory book that\'s been topping the charts of Amazon.com\'s Java category is <a href="http://www.amazon.com/exec/obidos/tg/detail/-/0596007124/104-4049655-7455156?v=glance">Head First Design Patterns</a>. Unorthodox, irreverent, funny and effective.</p>\n\n<p>Even more unorthodox is <a href="http://mitpress.mit.edu/catalog/item/default.asp?tid=3609&amp;ttype=2">A Little Java, A Few Patterns</a>. Written by Matthias Felleisen (co-author of <a href="http://mitpress.mit.edu/catalog/author/default.asp?aid=553">How to Design Programs</a>) and Daniel P. Friedman (co-author of <a href="http://mitpress.mit.edu/catalog/item/default.asp?ttype=2&amp;tid=3620">Essentials of Programming Languages</a>), this highly unusual book uses a socratic style of question-answer pairs to really engage the reader and make him understand how some patterns emerge as natural solutions for some problems. No prior knowledge is needed apart from basic Java and Object-Orientation. The book uses a style&nbsp; of OO Java that borrows heavily from functional programming ideas. Funny yet sophisticated, accessible yet surprisingly deep. Expect to reread this book several times.</p>\n\n<p><a href="http://www.cmcrossroads.com/bradapp/docs/patterns-intro.html">Patterns and Software: Essential Concepts and Terminology</a> also has a nice self-contained online introduction to pattern concepts. One of the GoF authors, John Vlissides, has an interesting article called <a href="http://www.research.ibm.com/designpatterns/pubs/top10misc.html">Patterns: The Top Ten Misconceptions</a>, where he addresses some common criticisms of patterns.</p>\n\n<p><a href="http://java.sun.com/blueprints/corej2eepatterns/Patterns/index.html" title="Core J2EE Patterns"><img width="290" height="384" border="0" alt="Corej2eepatterns" title="Corej2eepatterns" src="http://olifante.blogs.com/covil/images/corej2eepatterns.gif" style="border: 2px solid rgb(0, 0, 0);" /></a><br /><span style="font-size: 0.9em; margin-top: 0px;"><a href="http://java.sun.com/blueprints/corej2eepatterns/Patterns/index.html">Core J2EE Patterns</a></span></p>\n\n<p>The standard reference for J2EE-specific patterns is <a href="http://www.amazon.com/gp/product/0131422464/102-4255609-9112933?v=glance&amp;n=283155">Core J2EE Patterns: Best Practices and Design Strategies</a>, a Sun Microsystems book published by Prentice Hall. The text for the second part of the book, the pattern catalog itself, is available from sun.com at the <a href="http://java.sun.com/blueprints/corej2eepatterns/Patterns/index.html">Core J2EE Patterns: Patterns</a> index page. Just click on each pattern to access its detailed description, complete with UML diagrams and sample code. <a href="http://java.sun.com/blueprints/patterns/catalog.html">J2EE Patterns Catalog</a>, another Sun page, has links to some alternative descriptions. <a href="http://java.sun.com/blueprints/guidelines/designing_enterprise_applications_2e/">Designing Enterprise Applications with the J2EE Platform, Second Edition</a>, another Sun book, also has some J2EE pattern information and is now available for free both in <a href="http://java.sun.com/blueprints/guidelines/designing_enterprise_applications_2e/DEA2eTOC.html">HTML</a> and <a href="http://javashoplm.sun.com/ECom/docs/Welcome.jsp?StoreId=22&amp;PartDetailId=7036-design_ent_app-2.0-oth-JPR&amp;SiteId=JSC&amp;TransactionId=noreg">PDF</a> formats.</p>\n\n<p>TheServerSide.com has an <a href="http://www.theserverside.com/patterns/index.tss">Enterprise Java Patterns</a> page listing several patterns, and their EJB Design Patterns book is freely available in <a href="http://www.theserverside.com/books/wiley/EJBDesignPatterns/downloads/ejbdesignpatterns.pdf">PDF</a> format. Be sure to check their useful <a href="http://www.theserverside.com/reviews/matrix.tss">J2EE Application Server Matrix</a> on the way out.</p>\n\n<p>The original c2.com Wiki by OO veteran Ward Cunningham has a concise <a href="http://c2.com/cgi/wiki?HistoryOfPatterns">History of Patterns</a>, a classification of <a href="http://c2.com/cgi/wiki?CategoryPattern">Pattern Categories</a> and a <a href="http://c2.com/cgi/wiki?PatternRelatedBookList">Pattern Related Book List</a>.</p>\n\n<p>The Hillside Group was created by several pattern pioneers and has a <a href="http://hillside.net/patterns/onlinepatterncatalog.htm">Pattern Catalog</a> with links to several other pattern pages.</p>\n\n' }
