{ layout: 'post',
  title: 'Startup School Impressions',
  published: true,
  category: [ 'Weblogs' ],
  __content: '\n<p>It\'s 6 a.m. and I\'ve been tossing and turning for the last hour. That\'s what you get from drinking too much champagne while helping an uncle configure his Mac for web and mail. Actually, maybe it\'s all Paul Graham\'s fault, since most of the ideas jumping around in my mind have to do with his <a href="http://startupschool.org">Startup School</a> from two weeks ago. I decided I might as well get up and write that post I\'ve been wanting to write ever since I got back from Boston. All in all, It was quite an experience.</p>\n\n<p>I almost didn\'t make it to the US. It was only the night before my flight to Boston that I found out that my perfectly valid Portuguese passport was no longer good enough to get into the States. Since last April, US visa waivers only apply to holders of machine-readable passports. Next morning at 8 AM I was standing in line in front of the US embassy to try to get an entry visa. When I finally got in, I found out that the computer system was down, and that the list of requirements for getting a visa was so long that there was no way I was going to get one that morning. I switched to plan B and tried to get a new passport issued in 2 hours instead of the usual minimum 24 hours. Things didn\'t look good when I got to the &quot;Governo Civil de Lisboa&quot;: Their computer system was also down, and they told me my chances of getting a new passport in time for my flight were very slim. Fortunately, at 11:45 it finally started working, and I got a brand new passport just in time to catch my 2 PM flight. I left wondering what kind of shared distributed system that was causing problems both at the US embassy and the local passport issuer. Maybe some kind of Interpol felon database...</p>\n\n<p><a href="http://olifante.blogs.com/.shared/image.html?/photos/uncategorized/ichat_bonjour_smudged.png" onclick="window.open(this.href, \'_blank\', \'width=283,height=703,scrollbars=no,resizable=no,toolbar=no,directories=no,location=no,menubar=no,status=no,left=0,top=0\'); return false"><img width="100" height="248" border="0" alt="Ichat_bonjour_smudged" title="Ichat_bonjour_smudged" src="http://olifante.blogs.com/covil/images/ichat_bonjour_smudged.png" style="margin: 0px 5px 5px 0px; float: left;" /></a> I got to the Harvard Science building next morning at around 9:15 and joined a nearly packed auditorium. I didn\'t catch much of the first talk by Trip Advisor\'s founder, although it sounded interesting. I took a good look around: Most people seemed to be in their early twenties and the audience was overwhelmingly male. I saw 10 to 20 people who might be women, and discovered later that some of them were just guys with long hair (in his talk, Paul Graham came up with an interesting explanation for why so few women start tech startups). Many in the audience were using laptops, particularly Apple laptops - mostly Powerbooks, with a few scattered iBooks. Many seemed to be engaged in collective note-taking with SubEthaEdit. I tried to join in, but for some reason it didn\'t work. I also tried use Bonjour iChat to see if anyone was talking about the conference, but although I could see a lot of users I couldn\'t chat with anyone. A few other Mac users had the same problem.</p>\n\n\n\n\n\n<p>The day went by pretty quickly as I was engrossed in the presentations, a total of 13 from 9 to 5. Topics included Intellectual Property, Legal Issues, Economics, Venture Capital and Finance for Startups (I actually found this last one quite interesting). Most speakers were quite good, some were excellent. Steve Wozniak was amazing,\nand was the only speaker to get a well deserved standing ovation. The\nYahoo guy was perhaps the least exciting of all speakers, I found it\nhard to pay attention to what he said. Stan Reiss was in my opinion one of the best speakers, presenting a fascinating account of how Venture Capital firms work and why they can be useful. Olin Shivers also did an excellent, gripping presentation covering a lot of stuff, including a critique of VCs with the über-quotable headline &quot;<strong>VCs: soulless agents of Satan or just clumsy rapists?</strong>&quot;. I managed to ask Paul Graham a question in his keynote\'s question round (&quot;yes, you, the guy in the orange shirt&quot;): &quot;if you have an idea you believe is valuable, how hard should you try to protect it, and who can you share it with?&quot;. Paul answered with some good advice, but I still asked him, tongue-in-cheek, &quot;should I tell you?&quot;, to which he promptly replied &quot;No!!&quot;, drawing a round of laughter.</p>\n\n<p>A lot of interesting data entered into my brain, hopefully some of it stuck. Fortunately I can always recap with the <a href="http://startupschool.infogami.com/Presentations">online slides</a>, the <a href="http://wiki.ycombinator.com/presentations/podcast.xml">mp3 podcasts</a> and the <a href="http://startupschool.infogami.com/Notes">assorted notes</a>. The best part of the conference, however, was the social networking that took place in and around it, and the sheer buzz and energy that people seemed to share. Although most people left at the end of the conference, a few dozen people remained clustered around some of the speakers, asking questions and exchanging ideas. I had a nice burrito at some Mexican place near Harvard Square (Felipe\'s something?) with a bunch of them, and we had fun discussing tools, languages and startups. One of them was a Google guy who earlier had declined to answer a couple of questions I asked, saying &quot;I don\'t have clearance for answering that&quot;. </p>\n\n<p><a href="http://www.flickr.com/photos/olifante/54578384/" title="photo sharing"><img src="http://static.flickr.com/26/54578384_ca855f90af_m.jpg" style="border: 2px solid rgb(0, 0, 0);" /></a><br /><span style="font-size: 0.9em; margin-top: 0px;"><a href="http://www.flickr.com/photos/olifante/54578384/">Paul Graham</a></span></p>\n\n<p>I was lucky enough to be invited by Paul Graham at the end of the conference to show up next day at Y Combinator\'s open house - I think he was so amazed that I had come all the way from Europe (I was one of only 4 europeans at the conference) that he thought I deserved a break. Y Combinator is about half an hour on foot from Harvard Square, and is housed in a small one-floor square building. From the outside it doesn\'t look like much, but inside it\'s very pleasantly laid out and decorated - I took <a href="http://www.flickr.com/photos/olifante/tags/ycombinator/">a few photos</a> with my phone camera. It seems that Paul\'s aesthetic sense doesn\'t only apply to computer code, which is not altogether surprising given that he\'s also a painter. Around 30 people were there, about a third of them members of the Summer Founders program. I met a lot of interesting and interested people, who were discussing their projects. I don\'t yet have a project of my own to discuss, so we discussed practices, tools and languages, same as the day before. What emerged from the discussions at the open house and later around dinner was a kind of consensus: nobody at the Startup School seems to consider using anything other than agile programming languages. No mention was made by anyone I talked to of using Java, C# or other staticly typed languages, but also no mention of Perl or even PHP. The only credible contenders seem to be Lisp, Scheme, Ruby and Python, at least for this crowd (applications for Startup School were selected by Paul, who has a generic dynamic language bias and is a Lisp evangelizer). Oh, and EVERYBODY\'s heard about Ruby on Rails, most are interested, many are already using it. I\'ve been learning Rails too, and I have to agree: it\'s a wonderful tool.</p>\n\n<p>So, apart from meeting celebrities, learning stuff, having fun, meeting people, discovering Boston and spending a lot of money on air flights and hotels, what did I get from this conference? Well, most of all a sense that the time is pregnant with opportunities, and the sooner you have something you can show other people the better. The fact that so many clever and dynamic people believe this and are doing something about it really excited me and gave me the confidence and the energy to do something of my own. One of the guys I met at Y Combinator repeatedly said &quot;We\'re crazy! This is all crazy&quot;. In a way he\'s right: most of us will fail. Nevertheless, I still left Boston feeling that it was sheer insanity not to try to act on my ideas.<br /><br />Many thanks to Paul Graham for conceiving and organizing this new kind of event. I hope it will inspire other events of the same kind, particularly in Europe where people as not as interested in entrepreneurship (probably someone other than Paul will have to do it - his plans are to eventually do another Startup School on the West Coast, and perhaps later in China). I\'m confident many a doubter will be more eager to dive into the water after such an experience.</p>\n\n' }
