{ layout: 'post',
  title: 'Encontro Acidental',
  published: true,
  category: [ 'Portugal' ],
  __content: '\n<p>Um artigo de hoje n\'<a href="http://www.a-praia.blogspot.com/2005_01_01_a-praia_archive.html#110693088494995516" title="A Praia">A Praia</a> do Ivan Nunes levou-me a descobrir o <a href="http://oacidental.blogspot.com/" rel="nofollow">O Acidental</a>, um blog de direita escrito por Paulo Pinto Mascarenhas e outros apoiantes do PP. Demorei algum tempo a perceber os galhardetes dirigidos pelo <del>Paulo Pinto Mascarenhas</del> Luciano Amaral ao IN, mas finalmente fez-se luz: o post do IN aponta para O Acidental como se fosse <a href="http://oanacleto.blogspot.com/" rel="nofollow">O Anacleto</a>. O Anacleto, que não conhecia, parece ser um blog satírico de direita que se apresenta como uma paródia de um blog de extrema-esquerda, e a &quot;confusão&quot; do IN provavelmente indica que a malta d\'O Acidental também está por trás d\'O Anacleto.</p>\n\n<p>Li vários posts d\'O Acidental, e deixei-o com a impressão que me deixa uma boa parte da blogosfera portuguesa: uma obsessão com o humor caceteiro e adolescente, a pingar escárnio e mal-dizer, e uma obsessão com a política, em particular com a visão clubística da política. Fico com a impressão de que O Acidental não seria muito diferente se defendesse o Benfica vituperando contra os Sportinguistas...</p>\n\n<p>Como não simpatizei particularmente nem com O Anacleto nem com O Acidental, não tenho especial vontade de os premiar com um link, contribuindo assim para subir o seu ranking nos motores de busca. Aproveitei assim para estrear a <a href="http://www.google.com/googleblog/2005/01/preventing-comment-spam.html">nova técnica</a> introduzida pelo Google para criar links que não são pontuados pelo seu motor de busca. A sintaxe é bastante simples: em vez de escrever</p>\n\n<p><code>&lt;a href=&quot;http://oacidental.blogspot.com/&quot;&gt;O Acidental&lt;/a&gt;</code>\n\n</p>\n\n<p>basta acrescentar ao elemento &quot;a&quot; o atributo rel=&quot;nofollow&quot;</p>\n\n<p><code>&lt;a href=&quot;http://oacidental.blogspot.com/&quot; rel=&quot;nofollow&quot;&gt;O Acidental&lt;/a&gt;</code></p>\n\n' }
