{ layout: 'post',
  title: 'New Super Mario Bros is Da Bomb!',
  published: true,
  category: [ 'Games' ],
  __content: '\n<p><img border="0" src="http://olifante.blogs.com/photos/uncategorized/2007/04/06/nsmb_buddy_8.gif" title="Nsmb_buddy_8" alt="Nsmb_buddy_8" style="margin: 0px 5px 5px 0px; float: left;" />\nToday I spent a couple of hours playing New Super Mario Bros on my wife\'s Nintendo DS Lite, and I\'ve just quit in frustation.</p>\n\n<p>The game scored well enough on <a href="http://www.metacritic.com/games/ds/scores/">Metacritic</a> that I decided to buy the game a month ago, in spite of some reviewers saying it was too short, too easy or too unoriginal. Since I\'d never really played any game in the <a href="http://en.wikipedia.org/wiki/Mario">Mario series</a>, I thought I\'d give it a try. To my delight, I found the game very enjoyable.</p>\n\n<p>NSMB is easy enough that I was able to finish it without using any clues or cheats, but not without some effort and persistence. It took me a couple of weeks spread out over several one or two hour playing sessions, although I imagine that a dedicated player would be able to finish it in one day.</p>\n\n<p><strong>Just One More Level</strong></p>\n\n<p>The game is well-engineered to be addictive, so that you keep saying to yourself &quot;just one more level&quot;. I\'ve also found it to have lasting value. Usually, when I finish a game, I am done with it. Since finishing NSMB, however, I\'ve been busy shuffling back and forth between worlds, tryings to collect all big stars and discover the many remaining secrets. </p>\n\n<p>Since I couldn\'t discover by myself how to unlock worlds 4 and 7 (not needed to finish the game), I looked around and learned that you have to defeat the final boss in worlds 2 and 5 as Mini Mario to unlock the alternative worlds. After finishing world 4, I\'ve been trying to trying to unlock World 7 for a week now, and am now close to giving up and starting to look for cheats instead of clues.</p>\n\n<p>In the meantime, my wife keeps complaining that I\'ve kidnapped her DS... What an ungrateful dame ;-)</p>\n\n<p><strong>Of Wives and Guinea Pigs</strong></p>\n\n<p>As most gadget freaks, I occasionally buy stuff for my wife that I\'m actually itching to buy for myself. That\'s how she got her iPod mini, her Palm Zire and later her Tungsten TX, her Sony Ericsson K750i camera phone, her Nokia N70 phone and her Nintendo DS.</p>\n\n<p>The iPod mini didn\'t take root. She never used it, and when my <a href="http://en.wikipedia.org/wiki/IPod_photo">iPod Photo</a> died when barely 2 years old, I mysteriously &quot;inherited&quot; her iPod mini, which I continue to use heavily to study Mandarin Chinese.</p>\n\n<p>I\'ve managed to turned her into a Palm addict, even if it took three tries: first an old Sony Clie Palm I had lying around, later a Palm Zire and finally the glorious TX, which finally lured her into full-blown PDAness. Although I occasionally salivate over her Palm TX, I\'ve been brave and stuck to my trusty Palm T3 -- after all it still works perfectly after 3+ years and does almost everything I need apart from WiFi, so it\'s hard to justify replacing it.</p>\n\n<p>As for her K750i phone, she loves it. I liked it so much myself, I ended up buying another one to replace my faithful Sony Ericsson T610. The K750i camera has autofocus and is actually a pretty good point-and-shoot camera, good enough to replace a dedicated camera on a vacation if you\'re not a sophisticated photographer. The K750i was the <a href="http://www.techcrunch.com/2006/11/22/whats-the-most-popular-camera-on-flickr/">most popular camera phone in Flickr in 2006</a>, followed by the Nokia N70. Both have now been <a href="http://bighugelabs.com/flickr/topcameras.php">overtaken by newer phones</a> such as the Nokia N73 and the Sony Ericsson K800i. The K750i was the best damn mobile I ever had, but it was gone when I left it in the office late one night, never to be seen again. Dear five finger discounter, wherever you are, please lavish all your love on this precious phone! It deserves it.</p>\n\n<p>I\'ve been eyeing other Sony Ericsson camera phones, but the ones I\'m interested in either don\'t have autofocus or lack a lens lid, an incomprehensible oversight if you ask me. In the meantime I\'ve been using my wife\'s N70 ever since my K750i was stolen. She never did warm up to it, which I understand -- even though I now enjoy it and find it a very powerful phone, it\'s not as intuitive and easy to use as the SE K750i. However, for heavy mobile app users the N70 is a godsend. I frequently juggle multiple Java apps with ease, switching from <a href="http://www.operamini.com/">Opera Mini</a> to <a href="http://www.google.com/mobile/mail/index.html">Google Mobile Gmail</a> to <a href="http://www.google.com/gmm/index.html">Google Mobile Maps</a> to <a href="http://www.mgmaps.com/">Mobile Gmaps</a>. To top it all off, the N70 even runs Python, although to be honest I\'ve only played a bit with.</p>\n\n<p>Anyway, the good news is that <a href="http://www.metacritic.com/games/platforms/wii/superpapermario">Super Paper Mario</a> is finally being released for the Nintendo Wii, so my should soon be able to finally wrest her DS from my death-like grip.</p>\n\n' }
