{ layout: 'post',
  title: 'Map of Global Cities',
  published: true,
  __content: '\n<p>I found a thought-provoking interactive map of 1st-, 2nd- and 3rd-tier <a href="http://en.wikipedia.org/wiki/Global_city">global cities</a> produced by the <a href="http://www.lboro.ac.uk/gawc/group.html">Globalization and World Cities Study Group</a> of Loughborough University:\n</p>\n\n<p>\n<a href="http://www.lboro.ac.uk/gawc/citymap.html"></a></p>\n\n<p><a href="http://www.lboro.ac.uk/gawc/citymap.html"><img width="350" height="221" border="0" alt="World" title="Inventory of World Cities" src="http://olifante.blogs.com/covil/images/2008/04/04/world.gif" /></a>\n</p>\n\n<p>\n\nThe GaWC group uses the term World City, but I prefer the term Global City -- it\'s less prone to confusion. Besides the list of alpha, beta and gamma global cities, the GaWC group also provides a secondary ranking of <a href="http://www.lboro.ac.uk/gawc/citylist.html">cities possibly on their way to Global City status</a>:</p>\n\n<ul><li><strong>Relatively strong evidence:</strong>\nAthens, Auckland, Dublin, Helsinki, Luxembourg, Lyon, Mumbai, New Delhi, Philadelphia, Rio de Janeiro, Tel Aviv, Vienna</li>\n\n<li><strong>Some evidence:</strong>\nAbu Dhabi, Almaty, Birmingham, Bogota, Bratislava, Brisbane, Bucharest, Cairo, Cleveland, Cologne, Detroit, Dubai, Ho Chi Minh City, Kiev, Lima, <strong>Lisbon</strong>, Manchester, Montevideo, Oslo, Riyadh, Rotterdam, Seattle, Stuttgart, The Hague, Vancouver</li>\n\n<li><strong>Minimal evidence:</strong>\nAdelaide, Antwerp, Arhus, Baltimore, Bangalore, Bologna, Brasilia, Calgary, Cape Town, Colombo, Columbus, Dresden, Edinburgh, Genoa, Glasgow, Gothenburg, Guangzhou, Hanoi, Kansas City, Leeds, Lille, Marseille, Richmond, St Petersburg, Tashkent, Tehran, Tijuana, Turin, Utrecht, Wellington</li></ul>\n\n<p>I find their positioning of Lisbon in the &quot;<strong>Some evidence</strong>&quot; category quite puzzling. Ranking Lisbon at the same global-city level as Oslo, Birmingham and Brisbane seems questionable, to say nothing of bundling it with cities such as Brisbane, Bucharest, Bratislava(!), Montevideo(!!) and Almaty(!!!??).</p>\n\n<p>Lisbon is no Manhattan, but it is not exactly a backwater either. According to Euro Monitor\'s list of <a href="http://www.euromonitor.com/Top_150_City_Destinations_London_Leads_the_Way">Top 150 City Destinations</a> in the world, Lisbon is placed at a respectable <strong>47th</strong> place, with <strong>1.7 million arrivals per year</strong>, higher than Zurich\'s 1.4 million and São Paulo\'s 1.1 million, two cities classified by the GaWC group as beta global cities.</p>\n\n<p>Lisbon is also the <strong>7th</strong> most <a href="http://www.traveldailynews.com/makeof.asp?central_id=1437&amp;permanent_id=17">popular city in Europe for meetings and conventions</a>, according to the International Association Meetings Market 2006\nsurvey of the International Congress &amp; Convention Association:</p>\n\n<ol><li>Vienna - 147 meetings during 2006</li>\n\n<li>Paris - 130</li>\n\n<li>Barcelona - 103</li>\n\n<li>Berlin - 91</li>\n\n<li>Budapest - 86</li>\n\n<li>Prague - 82</li>\n\n<li>Lisbon &amp; Copenhagen - 69 each</li></ol>\n\n<p>Portugal itself ranks <strong>15th</strong> out of 130 in the <a href="http://www.weforum.org/en/initiatives/gcp/TravelandTourismReport/index.htm">Travel &amp; Tourism Competitiveness Index for 2008</a>, and Lisbon must surely be one of the two major travel destinations within the country (the other being the beaches of Algarve).</p>\n\n<p>Of course, tourism and conventions alone do not a Global City make, but I would still expect a stronger correlation. I don\'t know all the criteria the GaWC group uses for their classification, but it seems to me they need to revisit some of them.</p>\n\n' }
