{ layout: 'post',
  title: 'TweetDeck vs. Twhirl',
  published: true,
  category: [ 'Web/Tech' ],
  __content: '\n<p><strong>(scroll to bottom for Iain\'s reply to my nits with TweetDeck)</strong></p>\n\n<p>Earlier today I <a href="http://twitter.com/olifante/statuses/930416745">lamented on Twitter</a> that I get an error whenever I try to favorite a tweet using <a href="http://www.twhirl.org/">Twhirl</a> or <a href="http://www.tweetdeck.com/">TweetDeck</a>, my favorite and 2nd favorite Twitter clients for OS X. Shortly after, a Iain Dodsworth replied, pointing out that TweetDeck hasn\'t yet added the ability to favorite tweets, so might I not be a tad mistaken?</p>\n\n<p>Well, Iain turns out to be the TweetDeck creator, who apparently pays close attention whenever the word TweetDeck is tweeted. So sorry, Iain, I am indeed mistaken: while Twhirl gives me a "limit exceeded" error whenever I try to favorite a tweet, TweetDeck doesn\'t yet have that functionality. It does have a button labeled F which is currently greyed out but which will presumably allow you to set favorites at some point. So for the moment, I use Twitterrific on my iPhone whenever I really want to favorite something.</p>\n\n<p>Since I caught Iain\'s attention, I profitted from the occasion to send him a message outlining some of the reasons why, much as I like some of TweetDeck\'s functionality, I still prefer Twhirl. Here\'s the list of my nits to pick with TweetDeck:</p>\n\n<ol>\n<li><p>Twhirl is more compact. In TweetDeck, all tweets take the same vertical space, regardless of whether they\'re one-liners or five-liners. This means I can see more Tweets in one Twhirl column than in TweetDeck. One simple way to regain vertical space would be to move the Reply/D/R/F buttons from below the pictures to the left or right of the pictures. Each tweet would now only be as high as the user\'s pics.</p></li>\n<li><p>Re-ordering groups with the move left/right buttons is cumbersome. Either implement drag-and-drop for column re-ordering or add a pop-up menu where you can drag the column names up and down to their desired positions, instead of having to move them one step at a time.</p></li>\n<li><p>The "All Tweets" column becomes less useful when you have created your own groups. Whenever I add someone to a group, I now see their tweets in two places. This might be the intended result for some people, but not for me. I don\'t have everyone I follow added to a group, only the ones I pay more attention to (friends, acquaintances, gurus). This means I have to filter the tweets I\'ve already read when I scan the All Tweets columns for lower priority tweets. A simple workaround for this problem would be to create an "Ungrouped" column and allow me to use that instead of the "All Tweets" column.</p></li>\n<li><p>Allow me to fit more than one group in one column. I don\'t have TweetDeck running all the time, so some columns are empty or mostly empty much of the time, such as the "Direct Messages" one.</p></li>\n<li><p>Allow me to resize the width of each column, so I can fit more on the screen at the same time.</p></li>\n<li><p>When I click on one of the fast access buttons (Replies/Direct/Twitscoop/12seconds), do not add a duplicate column if one already exists.</p></li>\n<li><p>Allow me to mark a tweet as a favorite ;-)</p></li>\n</ol>\n\n<p>Notwithstanding these nits, TweetDeck has several appealing features, such as:</p>\n\n<ol>\n<li><p>Being able to place the people you\'re following to different groups and display each group in its own column.</p></li>\n<li><p>Built-in search, including the ability to create a self-updating search column (I presume this is how Iain found my tweet).</p></li>\n<li><p>Built-in URL shortening, with the ability to choose your favorite service (currently I mostly use http://is.gd).</p></li>\n<li><p>Built-in support for <a href="http://www.twitscoop.com">TwitScoop</a>, letting you see what are the "hottest" words being tweeted in the twittosphere.</p></li>\n<li><p>Built-in support for <a href="http://12seconds.tv">12seconds.tv</a>, a cross between twitter and seesmic, where instead of posting 140 character status updates you post 12 second videos. Haven\'t tried it out yet, though.</p></li>\n<li><p><strong>Update:</strong> I forgot to mention one of TweetDeck\'s conveniences, which is the nifty Twitter API status indicator in the lower right-hand corner. This is useful whenever there\'s trouble in the twittosphere.</p></li>\n</ol>\n\n<p>On the other hand, Twhirl has a few tricks of its own up its sleeve:</p>\n\n<ol>\n<li><p>Support for <a href="http://www.seesmic.com/">Seesmic</a>, which is currently the dominant video micro blogging platform. Nevertheless, I\'ve tried Seesmic and found it a bit boring, with too many rambling monologues. Perhaps the 12 second limitation could prove as liberating as the Twitter 140 character limit.</p></li>\n<li><p>Support for <a href="http://friendfeed.com/olifante">friendfeed</a>, Paul Bucheit\'s wonderful life feed aggregator.</p></li>\n<li><p>Ability to crosspost to <a href="http://pownce.com/olifante/">Pownce</a> and <a href="http://www.jaiku">Jaiku</a>. <br />\n<strong>Update:</strong> I just checked out my Pownce account, and it seems like only some of the tweets sent using Twhirl are reaching Pownce, so this feature is only half-working (and I\'m not talking about tweets sent via other clients, which of course won\'t be automatically crossposted to Pownce). I can\'t confirm whether the same happens with Jaiku, since I don\'t have an account there.</p></li>\n</ol>\n\n<p>I really enjoy these last two features, so for the moment Twhirl has my heart.</p>\n\n<h3>2008-09-22 Update -- Iain\'s reply</h3>\n\n<p>Iain replied via email 10 minutes after I sent him an email, but I was busy writing this post so I didn\'t notice it. Here\'s his answers to my nits:</p>\n\n<ol>\n<li><p>Twhirl is more compact <br />\n<em>Iain: removal of tweet buttons implemented in next version</em></p></li>\n<li><p>Re-ordering is cumbersome <br />\n<em>Iain: due to be implemented in a near future version</em></p></li>\n<li><p>"Ungrouped" column <br />\n<em>Iain: All Tweets column is removable in the next version, good idea on the ungrouped column - I\'ll get that implemented</em></p></li>\n<li><p>More than one group in same column <br />\n<em>Iain: unused columns are removed from view in the next version</em></p></li>\n<li><p>Resizable columns <br />\n<em>Iain: working on this - BUT I have to be careful to not ruin the look of TweetDeck, I\'ve tried different height tweets and they completely ruin the feel</em></p></li>\n<li><p>Buttons add duplicate columns <br />\n(this nit was missing from my first email to Iain, so no answer from him yet)</p></li>\n<li><p>Favorite tweets <br />\n<em>Iain: implemented in next version</em></p></li>\n</ol>\n\n\n' }
